__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
lambda_16 (Lambda)              [(None, 224, 224, 1) 0           input_6[0][0]                    
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 224, 224, 64) 640         lambda_16[0][0]                  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 224, 224, 64) 640         lambda_16[0][1]                  
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 224, 224, 64) 640         lambda_16[0][2]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 224, 224, 64) 0           conv2d_54[0][0]                  
                                                                 conv2d_55[0][0]                  
                                                                 conv2d_56[0][0]                  
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 224, 224, 64) 0           add_6[0][0]                      
__________________________________________________________________________________________________
lambda_17 (Lambda)              [(None, 224, 224, 21 0           activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 224, 224, 64) 12160       lambda_17[0][0]                  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 224, 224, 64) 12160       lambda_17[0][1]                  
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 224, 224, 64) 12736       lambda_17[0][2]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 224, 224, 64) 0           conv2d_57[0][0]                  
                                                                 conv2d_58[0][0]                  
                                                                 conv2d_59[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 224, 224, 64) 0           add_7[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 112, 112, 64) 0           activation_7[0][0]               
__________________________________________________________________________________________________
lambda_18 (Lambda)              [(None, 112, 112, 21 0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 112, 112, 128 24320       lambda_18[0][0]                  
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 112, 112, 128 24320       lambda_18[0][1]                  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 112, 112, 128 25472       lambda_18[0][2]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 112, 112, 128 0           conv2d_60[0][0]                  
                                                                 conv2d_61[0][0]                  
                                                                 conv2d_62[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 112, 112, 128 0           add_8[0][0]                      
__________________________________________________________________________________________________
lambda_19 (Lambda)              [(None, 112, 112, 42 0           activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 112, 112, 128 48512       lambda_19[0][0]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 112, 112, 128 48512       lambda_19[0][1]                  
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 112, 112, 128 50816       lambda_19[0][2]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 112, 112, 128 0           conv2d_63[0][0]                  
                                                                 conv2d_64[0][0]                  
                                                                 conv2d_65[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 112, 112, 128 0           add_9[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 56, 56, 128)  0           activation_9[0][0]               
__________________________________________________________________________________________________
lambda_20 (Lambda)              [(None, 56, 56, 42), 0           max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 56, 56, 256)  97024       lambda_20[0][0]                  
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 56, 56, 256)  97024       lambda_20[0][1]                  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 56, 56, 256)  101632      lambda_20[0][2]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 56, 56, 256)  0           conv2d_66[0][0]                  
                                                                 conv2d_67[0][0]                  
                                                                 conv2d_68[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 56, 56, 256)  0           add_10[0][0]                     
__________________________________________________________________________________________________
lambda_21 (Lambda)              [(None, 56, 56, 85), 0           activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 56, 56, 256)  196096      lambda_21[0][0]                  
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 56, 56, 256)  196096      lambda_21[0][1]                  
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 56, 56, 256)  198400      lambda_21[0][2]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 56, 56, 256)  0           conv2d_69[0][0]                  
                                                                 conv2d_70[0][0]                  
                                                                 conv2d_71[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 56, 56, 256)  0           add_11[0][0]                     
__________________________________________________________________________________________________
lambda_22 (Lambda)              [(None, 56, 56, 85), 0           activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 56, 56, 256)  196096      lambda_22[0][0]                  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 56, 56, 256)  196096      lambda_22[0][1]                  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 56, 56, 256)  198400      lambda_22[0][2]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 56, 56, 256)  0           conv2d_72[0][0]                  
                                                                 conv2d_73[0][0]                  
                                                                 conv2d_74[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 56, 56, 256)  0           add_12[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 28, 28, 256)  0           activation_12[0][0]              
__________________________________________________________________________________________________
lambda_23 (Lambda)              [(None, 28, 28, 85), 0           max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 28, 28, 512)  392192      lambda_23[0][0]                  
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 28, 28, 512)  392192      lambda_23[0][1]                  
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 28, 28, 512)  396800      lambda_23[0][2]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 28, 28, 512)  0           conv2d_75[0][0]                  
                                                                 conv2d_76[0][0]                  
                                                                 conv2d_77[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 28, 28, 512)  0           add_13[0][0]                     
__________________________________________________________________________________________________
lambda_24 (Lambda)              [(None, 28, 28, 170) 0           activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 28, 28, 512)  783872      lambda_24[0][0]                  
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 28, 28, 512)  783872      lambda_24[0][1]                  
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 28, 28, 512)  793088      lambda_24[0][2]                  
__________________________________________________________________________________________________
add_14 (Add)                    (None, 28, 28, 512)  0           conv2d_78[0][0]                  
                                                                 conv2d_79[0][0]                  
                                                                 conv2d_80[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 28, 28, 512)  0           add_14[0][0]                     
__________________________________________________________________________________________________
lambda_25 (Lambda)              [(None, 28, 28, 170) 0           activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 28, 28, 512)  783872      lambda_25[0][0]                  
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 28, 28, 512)  783872      lambda_25[0][1]                  
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 28, 28, 512)  793088      lambda_25[0][2]                  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 28, 28, 512)  0           conv2d_81[0][0]                  
                                                                 conv2d_82[0][0]                  
                                                                 conv2d_83[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 28, 28, 512)  0           add_15[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 14, 14, 512)  0           activation_15[0][0]              
__________________________________________________________________________________________________
lambda_26 (Lambda)              [(None, 14, 14, 170) 0           max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 14, 14, 512)  783872      lambda_26[0][0]                  
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 14, 14, 512)  783872      lambda_26[0][1]                  
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 14, 14, 512)  793088      lambda_26[0][2]                  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 14, 14, 512)  0           conv2d_84[0][0]                  
                                                                 conv2d_85[0][0]                  
                                                                 conv2d_86[0][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 14, 14, 512)  0           add_16[0][0]                     
__________________________________________________________________________________________________
lambda_27 (Lambda)              [(None, 14, 14, 170) 0           activation_16[0][0]              
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 14, 14, 512)  783872      lambda_27[0][0]                  
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 14, 14, 512)  783872      lambda_27[0][1]                  
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 14, 14, 512)  793088      lambda_27[0][2]                  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 14, 14, 512)  0           conv2d_87[0][0]                  
                                                                 conv2d_88[0][0]                  
                                                                 conv2d_89[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 14, 14, 512)  0           add_17[0][0]                     
__________________________________________________________________________________________________
lambda_28 (Lambda)              [(None, 14, 14, 170) 0           activation_17[0][0]              
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 14, 14, 512)  783872      lambda_28[0][0]                  
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 14, 14, 512)  783872      lambda_28[0][1]                  
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 14, 14, 512)  793088      lambda_28[0][2]                  
__________________________________________________________________________________________________
add_18 (Add)                    (None, 14, 14, 512)  0           conv2d_90[0][0]                  
                                                                 conv2d_91[0][0]                  
                                                                 conv2d_92[0][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 14, 14, 512)  0           add_18[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 7, 7, 512)    0           activation_18[0][0]              
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25088)        0           max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 4096)         102764544   flatten[0][0]                    
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 4096)         16781312    dense_16[0][0]                   
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 1000)         4097000     dense_17[0][0]                   
==================================================================================================
Total params: 138,365,992
Trainable params: 138,365,992
Non-trainable params: 0
__________________________________________________________________________________________________
None
