_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
vgg16_original_1_conv (Conv2 (None, 224, 224, 64)      1792      
_________________________________________________________________
vgg16_original_2_conv (Conv2 (None, 224, 224, 64)      36928     
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 112, 112, 64)      0         
_________________________________________________________________
vgg16_original_3_conv (Conv2 (None, 112, 112, 128)     73856     
_________________________________________________________________
vgg16_original_4_conv (Conv2 (None, 112, 112, 128)     147584    
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 56, 56, 128)       0         
_________________________________________________________________
vgg16_original_5_conv (Conv2 (None, 56, 56, 256)       295168    
_________________________________________________________________
vgg16_original_6_conv (Conv2 (None, 56, 56, 256)       590080    
_________________________________________________________________
vgg16_original_7_conv (Conv2 (None, 56, 56, 256)       590080    
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 28, 28, 256)       0         
_________________________________________________________________
vgg16_original_8_conv (Conv2 (None, 28, 28, 512)       1180160   
_________________________________________________________________
vgg16_original_9_conv (Conv2 (None, 28, 28, 512)       2359808   
_________________________________________________________________
vgg16_original_10_conv (Conv (None, 28, 28, 512)       2359808   
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 14, 14, 512)       0         
_________________________________________________________________
vgg16_original_11_conv (Conv (None, 14, 14, 512)       2359808   
_________________________________________________________________
vgg16_original_12_conv (Conv (None, 14, 14, 512)       2359808   
_________________________________________________________________
vgg16_original_13_conv (Conv (None, 14, 14, 512)       2359808   
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
vgg16_original_13_dense (Den (None, 4096)              102764544 
_________________________________________________________________
vgg16_original_14_dense (Den (None, 4096)              16781312  
_________________________________________________________________
vgg16_original_15_dense (Den (None, 1000)              4097000   
=================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
_________________________________________________________________
None
