__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_14 (Lambda)              [(None, 220, 220, 3) 0           input_3[0][0]                    
__________________________________________________________________________________________________
vgg16_channel_1_conv_0 (Conv2D) (None, 220, 220, 21) 588         lambda_14[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_1_conv_1 (Conv2D) (None, 220, 220, 21) 588         lambda_14[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_1_conv_2 (Conv2D) (None, 220, 220, 22) 616         lambda_14[0][2]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 220, 220, 64) 0           vgg16_channel_1_conv_0[0][0]     
                                                                 vgg16_channel_1_conv_1[0][0]     
                                                                 vgg16_channel_1_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_15 (Lambda)              [(None, 220, 220, 64 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
vgg16_channel_2_conv_0 (Conv2D) (None, 220, 220, 21) 12117       lambda_15[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_2_conv_1 (Conv2D) (None, 220, 220, 21) 12117       lambda_15[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_2_conv_2 (Conv2D) (None, 220, 220, 22) 12694       lambda_15[0][2]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 220, 220, 64) 0           vgg16_channel_2_conv_0[0][0]     
                                                                 vgg16_channel_2_conv_1[0][0]     
                                                                 vgg16_channel_2_conv_2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 110, 110, 64) 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
lambda_16 (Lambda)              [(None, 110, 110, 64 0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
vgg16_channel_3_conv_0 (Conv2D) (None, 110, 110, 42) 24234       lambda_16[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_3_conv_1 (Conv2D) (None, 110, 110, 42) 24234       lambda_16[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_3_conv_2 (Conv2D) (None, 110, 110, 44) 25388       lambda_16[0][2]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 110, 110, 128 0           vgg16_channel_3_conv_0[0][0]     
                                                                 vgg16_channel_3_conv_1[0][0]     
                                                                 vgg16_channel_3_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_17 (Lambda)              [(None, 110, 110, 12 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
vgg16_channel_4_conv_0 (Conv2D) (None, 110, 110, 42) 48426       lambda_17[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_4_conv_1 (Conv2D) (None, 110, 110, 42) 48426       lambda_17[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_4_conv_2 (Conv2D) (None, 110, 110, 44) 50732       lambda_17[0][2]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 110, 110, 128 0           vgg16_channel_4_conv_0[0][0]     
                                                                 vgg16_channel_4_conv_1[0][0]     
                                                                 vgg16_channel_4_conv_2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 55, 55, 128)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
lambda_18 (Lambda)              [(None, 55, 55, 128) 0           max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
vgg16_channel_5_conv_0 (Conv2D) (None, 55, 55, 85)   98005       lambda_18[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_5_conv_1 (Conv2D) (None, 55, 55, 85)   98005       lambda_18[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_5_conv_2 (Conv2D) (None, 55, 55, 86)   99158       lambda_18[0][2]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 55, 55, 256)  0           vgg16_channel_5_conv_0[0][0]     
                                                                 vgg16_channel_5_conv_1[0][0]     
                                                                 vgg16_channel_5_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_19 (Lambda)              [(None, 55, 55, 256) 0           concatenate_5[0][0]              
__________________________________________________________________________________________________
vgg16_channel_6_conv_0 (Conv2D) (None, 55, 55, 85)   195925      lambda_19[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_6_conv_1 (Conv2D) (None, 55, 55, 85)   195925      lambda_19[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_6_conv_2 (Conv2D) (None, 55, 55, 86)   198230      lambda_19[0][2]                  
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 55, 55, 256)  0           vgg16_channel_6_conv_0[0][0]     
                                                                 vgg16_channel_6_conv_1[0][0]     
                                                                 vgg16_channel_6_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_20 (Lambda)              [(None, 55, 55, 256) 0           concatenate_6[0][0]              
__________________________________________________________________________________________________
vgg16_channel_7_conv_0 (Conv2D) (None, 55, 55, 85)   195925      lambda_20[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_7_conv_1 (Conv2D) (None, 55, 55, 85)   195925      lambda_20[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_7_conv_2 (Conv2D) (None, 55, 55, 86)   198230      lambda_20[0][2]                  
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 55, 55, 256)  0           vgg16_channel_7_conv_0[0][0]     
                                                                 vgg16_channel_7_conv_1[0][0]     
                                                                 vgg16_channel_7_conv_2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 27, 27, 256)  0           concatenate_7[0][0]              
__________________________________________________________________________________________________
lambda_21 (Lambda)              [(None, 27, 27, 256) 0           max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
vgg16_channel_8_conv_0 (Conv2D) (None, 27, 27, 170)  391850      lambda_21[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_8_conv_1 (Conv2D) (None, 27, 27, 170)  391850      lambda_21[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_8_conv_2 (Conv2D) (None, 27, 27, 172)  396460      lambda_21[0][2]                  
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 27, 27, 512)  0           vgg16_channel_8_conv_0[0][0]     
                                                                 vgg16_channel_8_conv_1[0][0]     
                                                                 vgg16_channel_8_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_22 (Lambda)              [(None, 27, 27, 512) 0           concatenate_8[0][0]              
__________________________________________________________________________________________________
vgg16_channel_9_conv_0 (Conv2D) (None, 27, 27, 170)  783530      lambda_22[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_9_conv_1 (Conv2D) (None, 27, 27, 170)  783530      lambda_22[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_9_conv_2 (Conv2D) (None, 27, 27, 172)  792748      lambda_22[0][2]                  
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 27, 27, 512)  0           vgg16_channel_9_conv_0[0][0]     
                                                                 vgg16_channel_9_conv_1[0][0]     
                                                                 vgg16_channel_9_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_23 (Lambda)              [(None, 27, 27, 512) 0           concatenate_9[0][0]              
__________________________________________________________________________________________________
vgg16_channel_10_conv_0 (Conv2D (None, 27, 27, 170)  783530      lambda_23[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_10_conv_1 (Conv2D (None, 27, 27, 170)  783530      lambda_23[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_10_conv_2 (Conv2D (None, 27, 27, 172)  792748      lambda_23[0][2]                  
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 27, 27, 512)  0           vgg16_channel_10_conv_0[0][0]    
                                                                 vgg16_channel_10_conv_1[0][0]    
                                                                 vgg16_channel_10_conv_2[0][0]    
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 13, 13, 512)  0           concatenate_10[0][0]             
__________________________________________________________________________________________________
lambda_24 (Lambda)              [(None, 13, 13, 512) 0           max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
vgg16_channel_11_conv_0 (Conv2D (None, 13, 13, 170)  783530      lambda_24[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_11_conv_1 (Conv2D (None, 13, 13, 170)  783530      lambda_24[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_11_conv_2 (Conv2D (None, 13, 13, 172)  792748      lambda_24[0][2]                  
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 13, 13, 512)  0           vgg16_channel_11_conv_0[0][0]    
                                                                 vgg16_channel_11_conv_1[0][0]    
                                                                 vgg16_channel_11_conv_2[0][0]    
__________________________________________________________________________________________________
lambda_25 (Lambda)              [(None, 13, 13, 512) 0           concatenate_11[0][0]             
__________________________________________________________________________________________________
vgg16_channel_12_conv_0 (Conv2D (None, 13, 13, 170)  783530      lambda_25[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_12_conv_1 (Conv2D (None, 13, 13, 170)  783530      lambda_25[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_12_conv_2 (Conv2D (None, 13, 13, 172)  792748      lambda_25[0][2]                  
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 13, 13, 512)  0           vgg16_channel_12_conv_0[0][0]    
                                                                 vgg16_channel_12_conv_1[0][0]    
                                                                 vgg16_channel_12_conv_2[0][0]    
__________________________________________________________________________________________________
lambda_26 (Lambda)              [(None, 13, 13, 512) 0           concatenate_12[0][0]             
__________________________________________________________________________________________________
vgg16_channel_13_conv_0 (Conv2D (None, 13, 13, 170)  783530      lambda_26[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_13_conv_1 (Conv2D (None, 13, 13, 170)  783530      lambda_26[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_13_conv_2 (Conv2D (None, 13, 13, 172)  792748      lambda_26[0][2]                  
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 13, 13, 512)  0           vgg16_channel_13_conv_0[0][0]    
                                                                 vgg16_channel_13_conv_1[0][0]    
                                                                 vgg16_channel_13_conv_2[0][0]    
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 6, 6, 512)    0           concatenate_13[0][0]             
__________________________________________________________________________________________________
flatten (Flatten)               (None, 18432)        0           max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
vgg16_channel_14_dense (Dense)  (None, 4096)         75501568    flatten[0][0]                    
__________________________________________________________________________________________________
vgg16_channel_15_dense (Dense)  (None, 4096)         16781312    vgg16_channel_14_dense[0][0]     
__________________________________________________________________________________________________
vgg16_channel_16_dense (Dense)  (None, 1000)         4097000     vgg16_channel_15_dense[0][0]     
==================================================================================================
Total params: 111,094,568
Trainable params: 111,094,568
Non-trainable params: 0
__________________________________________________________________________________________________
None
