__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_7 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
lambda_29 (Lambda)              [(None, 224, 224, 3) 0           input_7[0][0]                    
__________________________________________________________________________________________________
vgg16_channel_1_conv_0 (Conv2D) (None, 224, 224, 21) 588         lambda_29[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_1_conv_1 (Conv2D) (None, 224, 224, 21) 588         lambda_29[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_1_conv_2 (Conv2D) (None, 224, 224, 22) 616         lambda_29[0][2]                  
__________________________________________________________________________________________________
concatenate_26 (Concatenate)    (None, 224, 224, 64) 0           vgg16_channel_1_conv_0[0][0]     
                                                                 vgg16_channel_1_conv_1[0][0]     
                                                                 vgg16_channel_1_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_30 (Lambda)              [(None, 224, 224, 64 0           concatenate_26[0][0]             
__________________________________________________________________________________________________
vgg16_channel_2_conv_0 (Conv2D) (None, 224, 224, 21) 12117       lambda_30[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_2_conv_1 (Conv2D) (None, 224, 224, 21) 12117       lambda_30[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_2_conv_2 (Conv2D) (None, 224, 224, 22) 12694       lambda_30[0][2]                  
__________________________________________________________________________________________________
concatenate_27 (Concatenate)    (None, 224, 224, 64) 0           vgg16_channel_2_conv_0[0][0]     
                                                                 vgg16_channel_2_conv_1[0][0]     
                                                                 vgg16_channel_2_conv_2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D) (None, 112, 112, 64) 0           concatenate_27[0][0]             
__________________________________________________________________________________________________
lambda_31 (Lambda)              [(None, 112, 112, 64 0           max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
vgg16_channel_3_conv_0 (Conv2D) (None, 112, 112, 42) 24234       lambda_31[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_3_conv_1 (Conv2D) (None, 112, 112, 42) 24234       lambda_31[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_3_conv_2 (Conv2D) (None, 112, 112, 44) 25388       lambda_31[0][2]                  
__________________________________________________________________________________________________
concatenate_28 (Concatenate)    (None, 112, 112, 128 0           vgg16_channel_3_conv_0[0][0]     
                                                                 vgg16_channel_3_conv_1[0][0]     
                                                                 vgg16_channel_3_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_32 (Lambda)              [(None, 112, 112, 12 0           concatenate_28[0][0]             
__________________________________________________________________________________________________
vgg16_channel_4_conv_0 (Conv2D) (None, 112, 112, 42) 48426       lambda_32[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_4_conv_1 (Conv2D) (None, 112, 112, 42) 48426       lambda_32[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_4_conv_2 (Conv2D) (None, 112, 112, 44) 50732       lambda_32[0][2]                  
__________________________________________________________________________________________________
concatenate_29 (Concatenate)    (None, 112, 112, 128 0           vgg16_channel_4_conv_0[0][0]     
                                                                 vgg16_channel_4_conv_1[0][0]     
                                                                 vgg16_channel_4_conv_2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 56, 56, 128)  0           concatenate_29[0][0]             
__________________________________________________________________________________________________
lambda_33 (Lambda)              [(None, 56, 56, 128) 0           max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
vgg16_channel_5_conv_0 (Conv2D) (None, 56, 56, 85)   98005       lambda_33[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_5_conv_1 (Conv2D) (None, 56, 56, 85)   98005       lambda_33[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_5_conv_2 (Conv2D) (None, 56, 56, 86)   99158       lambda_33[0][2]                  
__________________________________________________________________________________________________
concatenate_30 (Concatenate)    (None, 56, 56, 256)  0           vgg16_channel_5_conv_0[0][0]     
                                                                 vgg16_channel_5_conv_1[0][0]     
                                                                 vgg16_channel_5_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_34 (Lambda)              [(None, 56, 56, 256) 0           concatenate_30[0][0]             
__________________________________________________________________________________________________
vgg16_channel_6_conv_0 (Conv2D) (None, 56, 56, 85)   195925      lambda_34[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_6_conv_1 (Conv2D) (None, 56, 56, 85)   195925      lambda_34[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_6_conv_2 (Conv2D) (None, 56, 56, 86)   198230      lambda_34[0][2]                  
__________________________________________________________________________________________________
concatenate_31 (Concatenate)    (None, 56, 56, 256)  0           vgg16_channel_6_conv_0[0][0]     
                                                                 vgg16_channel_6_conv_1[0][0]     
                                                                 vgg16_channel_6_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_35 (Lambda)              [(None, 56, 56, 256) 0           concatenate_31[0][0]             
__________________________________________________________________________________________________
vgg16_channel_7_conv_0 (Conv2D) (None, 56, 56, 85)   195925      lambda_35[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_7_conv_1 (Conv2D) (None, 56, 56, 85)   195925      lambda_35[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_7_conv_2 (Conv2D) (None, 56, 56, 86)   198230      lambda_35[0][2]                  
__________________________________________________________________________________________________
concatenate_32 (Concatenate)    (None, 56, 56, 256)  0           vgg16_channel_7_conv_0[0][0]     
                                                                 vgg16_channel_7_conv_1[0][0]     
                                                                 vgg16_channel_7_conv_2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 28, 28, 256)  0           concatenate_32[0][0]             
__________________________________________________________________________________________________
lambda_36 (Lambda)              [(None, 28, 28, 256) 0           max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
vgg16_channel_8_conv_0 (Conv2D) (None, 28, 28, 170)  391850      lambda_36[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_8_conv_1 (Conv2D) (None, 28, 28, 170)  391850      lambda_36[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_8_conv_2 (Conv2D) (None, 28, 28, 172)  396460      lambda_36[0][2]                  
__________________________________________________________________________________________________
concatenate_33 (Concatenate)    (None, 28, 28, 512)  0           vgg16_channel_8_conv_0[0][0]     
                                                                 vgg16_channel_8_conv_1[0][0]     
                                                                 vgg16_channel_8_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_37 (Lambda)              [(None, 28, 28, 512) 0           concatenate_33[0][0]             
__________________________________________________________________________________________________
vgg16_channel_9_conv_0 (Conv2D) (None, 28, 28, 170)  783530      lambda_37[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_9_conv_1 (Conv2D) (None, 28, 28, 170)  783530      lambda_37[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_9_conv_2 (Conv2D) (None, 28, 28, 172)  792748      lambda_37[0][2]                  
__________________________________________________________________________________________________
concatenate_34 (Concatenate)    (None, 28, 28, 512)  0           vgg16_channel_9_conv_0[0][0]     
                                                                 vgg16_channel_9_conv_1[0][0]     
                                                                 vgg16_channel_9_conv_2[0][0]     
__________________________________________________________________________________________________
lambda_38 (Lambda)              [(None, 28, 28, 512) 0           concatenate_34[0][0]             
__________________________________________________________________________________________________
vgg16_channel_10_conv_0 (Conv2D (None, 28, 28, 170)  783530      lambda_38[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_10_conv_1 (Conv2D (None, 28, 28, 170)  783530      lambda_38[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_10_conv_2 (Conv2D (None, 28, 28, 172)  792748      lambda_38[0][2]                  
__________________________________________________________________________________________________
concatenate_35 (Concatenate)    (None, 28, 28, 512)  0           vgg16_channel_10_conv_0[0][0]    
                                                                 vgg16_channel_10_conv_1[0][0]    
                                                                 vgg16_channel_10_conv_2[0][0]    
__________________________________________________________________________________________________
max_pooling2d_26 (MaxPooling2D) (None, 14, 14, 512)  0           concatenate_35[0][0]             
__________________________________________________________________________________________________
lambda_39 (Lambda)              [(None, 14, 14, 512) 0           max_pooling2d_26[0][0]           
__________________________________________________________________________________________________
vgg16_channel_11_conv_0 (Conv2D (None, 14, 14, 170)  783530      lambda_39[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_11_conv_1 (Conv2D (None, 14, 14, 170)  783530      lambda_39[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_11_conv_2 (Conv2D (None, 14, 14, 172)  792748      lambda_39[0][2]                  
__________________________________________________________________________________________________
concatenate_36 (Concatenate)    (None, 14, 14, 512)  0           vgg16_channel_11_conv_0[0][0]    
                                                                 vgg16_channel_11_conv_1[0][0]    
                                                                 vgg16_channel_11_conv_2[0][0]    
__________________________________________________________________________________________________
lambda_40 (Lambda)              [(None, 14, 14, 512) 0           concatenate_36[0][0]             
__________________________________________________________________________________________________
vgg16_channel_12_conv_0 (Conv2D (None, 14, 14, 170)  783530      lambda_40[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_12_conv_1 (Conv2D (None, 14, 14, 170)  783530      lambda_40[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_12_conv_2 (Conv2D (None, 14, 14, 172)  792748      lambda_40[0][2]                  
__________________________________________________________________________________________________
concatenate_37 (Concatenate)    (None, 14, 14, 512)  0           vgg16_channel_12_conv_0[0][0]    
                                                                 vgg16_channel_12_conv_1[0][0]    
                                                                 vgg16_channel_12_conv_2[0][0]    
__________________________________________________________________________________________________
lambda_41 (Lambda)              [(None, 14, 14, 512) 0           concatenate_37[0][0]             
__________________________________________________________________________________________________
vgg16_channel_13_conv_0 (Conv2D (None, 14, 14, 170)  783530      lambda_41[0][0]                  
__________________________________________________________________________________________________
vgg16_channel_13_conv_1 (Conv2D (None, 14, 14, 170)  783530      lambda_41[0][1]                  
__________________________________________________________________________________________________
vgg16_channel_13_conv_2 (Conv2D (None, 14, 14, 172)  792748      lambda_41[0][2]                  
__________________________________________________________________________________________________
concatenate_38 (Concatenate)    (None, 14, 14, 512)  0           vgg16_channel_13_conv_0[0][0]    
                                                                 vgg16_channel_13_conv_1[0][0]    
                                                                 vgg16_channel_13_conv_2[0][0]    
__________________________________________________________________________________________________
max_pooling2d_27 (MaxPooling2D) (None, 7, 7, 512)    0           concatenate_38[0][0]             
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25088)        0           max_pooling2d_27[0][0]           
__________________________________________________________________________________________________
vgg16_channel_14_dense (Dense)  (None, 4096)         102764544   flatten[0][0]                    
__________________________________________________________________________________________________
vgg16_channel_15_dense (Dense)  (None, 4096)         16781312    vgg16_channel_14_dense[0][0]     
__________________________________________________________________________________________________
vgg16_channel_16_dense (Dense)  (None, 1000)         4097000     vgg16_channel_15_dense[0][0]     
==================================================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
__________________________________________________________________________________________________
None
