_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_5 (InputLayer)         (None, 224, 224, 3)       0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 224, 224, 64)      1792      
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 224, 224, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 112, 112, 64)      0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 112, 112, 128)     73856     
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 112, 112, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 56, 56, 128)       0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 56, 56, 256)       295168    
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 56, 56, 256)       590080    
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 56, 56, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 28, 28, 256)       0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 28, 28, 512)       1180160   
_________________________________________________________________
conv2d_49 (Conv2D)           (None, 28, 28, 512)       2359808   
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 28, 28, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 14, 14, 512)       0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 14, 14, 512)       2359808   
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 14, 14, 512)       2359808   
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 14, 14, 512)       2359808   
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 7, 7, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 25088)             0         
_________________________________________________________________
dense_13 (Dense)             (None, 4096)              102764544 
_________________________________________________________________
dense_14 (Dense)             (None, 4096)              16781312  
_________________________________________________________________
dense_15 (Dense)             (None, 1000)              4097000   
=================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
_________________________________________________________________
None
