__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
lambda_16 (Lambda)              [(None, 224, 224, 1) 0           input_6[0][0]                    
__________________________________________________________________________________________________
vgg16_filter_1_conv_0 (Conv2D)  (None, 224, 224, 64) 576         lambda_16[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_1_conv_1 (Conv2D)  (None, 224, 224, 64) 576         lambda_16[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_1_conv_2 (Conv2D)  (None, 224, 224, 64) 640         lambda_16[0][2]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 224, 224, 64) 0           vgg16_filter_1_conv_0[0][0]      
                                                                 vgg16_filter_1_conv_1[0][0]      
                                                                 vgg16_filter_1_conv_2[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 224, 224, 64) 0           add_6[0][0]                      
__________________________________________________________________________________________________
lambda_17 (Lambda)              [(None, 224, 224, 21 0           activation_6[0][0]               
__________________________________________________________________________________________________
vgg16_filter_2_conv_0 (Conv2D)  (None, 224, 224, 64) 12096       lambda_17[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_2_conv_1 (Conv2D)  (None, 224, 224, 64) 12096       lambda_17[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_2_conv_2 (Conv2D)  (None, 224, 224, 64) 12736       lambda_17[0][2]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 224, 224, 64) 0           vgg16_filter_2_conv_0[0][0]      
                                                                 vgg16_filter_2_conv_1[0][0]      
                                                                 vgg16_filter_2_conv_2[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 224, 224, 64) 0           add_7[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 112, 112, 64) 0           activation_7[0][0]               
__________________________________________________________________________________________________
lambda_18 (Lambda)              [(None, 112, 112, 21 0           max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
vgg16_filter_3_conv_0 (Conv2D)  (None, 112, 112, 128 24192       lambda_18[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_3_conv_1 (Conv2D)  (None, 112, 112, 128 24192       lambda_18[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_3_conv_2 (Conv2D)  (None, 112, 112, 128 25472       lambda_18[0][2]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 112, 112, 128 0           vgg16_filter_3_conv_0[0][0]      
                                                                 vgg16_filter_3_conv_1[0][0]      
                                                                 vgg16_filter_3_conv_2[0][0]      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 112, 112, 128 0           add_8[0][0]                      
__________________________________________________________________________________________________
lambda_19 (Lambda)              [(None, 112, 112, 42 0           activation_8[0][0]               
__________________________________________________________________________________________________
vgg16_filter_4_conv_0 (Conv2D)  (None, 112, 112, 128 48384       lambda_19[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_4_conv_1 (Conv2D)  (None, 112, 112, 128 48384       lambda_19[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_4_conv_2 (Conv2D)  (None, 112, 112, 128 50816       lambda_19[0][2]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 112, 112, 128 0           vgg16_filter_4_conv_0[0][0]      
                                                                 vgg16_filter_4_conv_1[0][0]      
                                                                 vgg16_filter_4_conv_2[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 112, 112, 128 0           add_9[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 56, 56, 128)  0           activation_9[0][0]               
__________________________________________________________________________________________________
lambda_20 (Lambda)              [(None, 56, 56, 42), 0           max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
vgg16_filter_5_conv_0 (Conv2D)  (None, 56, 56, 256)  96768       lambda_20[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_5_conv_1 (Conv2D)  (None, 56, 56, 256)  96768       lambda_20[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_5_conv_2 (Conv2D)  (None, 56, 56, 256)  101632      lambda_20[0][2]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 56, 56, 256)  0           vgg16_filter_5_conv_0[0][0]      
                                                                 vgg16_filter_5_conv_1[0][0]      
                                                                 vgg16_filter_5_conv_2[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 56, 56, 256)  0           add_10[0][0]                     
__________________________________________________________________________________________________
lambda_21 (Lambda)              [(None, 56, 56, 85), 0           activation_10[0][0]              
__________________________________________________________________________________________________
vgg16_filter_6_conv_0 (Conv2D)  (None, 56, 56, 256)  195840      lambda_21[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_6_conv_1 (Conv2D)  (None, 56, 56, 256)  195840      lambda_21[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_6_conv_2 (Conv2D)  (None, 56, 56, 256)  198400      lambda_21[0][2]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 56, 56, 256)  0           vgg16_filter_6_conv_0[0][0]      
                                                                 vgg16_filter_6_conv_1[0][0]      
                                                                 vgg16_filter_6_conv_2[0][0]      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 56, 56, 256)  0           add_11[0][0]                     
__________________________________________________________________________________________________
lambda_22 (Lambda)              [(None, 56, 56, 85), 0           activation_11[0][0]              
__________________________________________________________________________________________________
vgg16_filter_7_conv_0 (Conv2D)  (None, 56, 56, 256)  195840      lambda_22[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_7_conv_1 (Conv2D)  (None, 56, 56, 256)  195840      lambda_22[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_7_conv_2 (Conv2D)  (None, 56, 56, 256)  198400      lambda_22[0][2]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 56, 56, 256)  0           vgg16_filter_7_conv_0[0][0]      
                                                                 vgg16_filter_7_conv_1[0][0]      
                                                                 vgg16_filter_7_conv_2[0][0]      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 56, 56, 256)  0           add_12[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 28, 28, 256)  0           activation_12[0][0]              
__________________________________________________________________________________________________
lambda_23 (Lambda)              [(None, 28, 28, 85), 0           max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
vgg16_filter_8_conv_0 (Conv2D)  (None, 28, 28, 512)  391680      lambda_23[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_8_conv_1 (Conv2D)  (None, 28, 28, 512)  391680      lambda_23[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_8_conv_2 (Conv2D)  (None, 28, 28, 512)  396800      lambda_23[0][2]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 28, 28, 512)  0           vgg16_filter_8_conv_0[0][0]      
                                                                 vgg16_filter_8_conv_1[0][0]      
                                                                 vgg16_filter_8_conv_2[0][0]      
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 28, 28, 512)  0           add_13[0][0]                     
__________________________________________________________________________________________________
lambda_24 (Lambda)              [(None, 28, 28, 170) 0           activation_13[0][0]              
__________________________________________________________________________________________________
vgg16_filter_9_conv_0 (Conv2D)  (None, 28, 28, 512)  783360      lambda_24[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_9_conv_1 (Conv2D)  (None, 28, 28, 512)  783360      lambda_24[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_9_conv_2 (Conv2D)  (None, 28, 28, 512)  793088      lambda_24[0][2]                  
__________________________________________________________________________________________________
add_14 (Add)                    (None, 28, 28, 512)  0           vgg16_filter_9_conv_0[0][0]      
                                                                 vgg16_filter_9_conv_1[0][0]      
                                                                 vgg16_filter_9_conv_2[0][0]      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 28, 28, 512)  0           add_14[0][0]                     
__________________________________________________________________________________________________
lambda_25 (Lambda)              [(None, 28, 28, 170) 0           activation_14[0][0]              
__________________________________________________________________________________________________
vgg16_filter_10_conv_0 (Conv2D) (None, 28, 28, 512)  783360      lambda_25[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_10_conv_1 (Conv2D) (None, 28, 28, 512)  783360      lambda_25[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_10_conv_2 (Conv2D) (None, 28, 28, 512)  793088      lambda_25[0][2]                  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 28, 28, 512)  0           vgg16_filter_10_conv_0[0][0]     
                                                                 vgg16_filter_10_conv_1[0][0]     
                                                                 vgg16_filter_10_conv_2[0][0]     
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 28, 28, 512)  0           add_15[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 14, 14, 512)  0           activation_15[0][0]              
__________________________________________________________________________________________________
lambda_26 (Lambda)              [(None, 14, 14, 170) 0           max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
vgg16_filter_11_conv_0 (Conv2D) (None, 14, 14, 512)  783360      lambda_26[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_11_conv_1 (Conv2D) (None, 14, 14, 512)  783360      lambda_26[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_11_conv_2 (Conv2D) (None, 14, 14, 512)  793088      lambda_26[0][2]                  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 14, 14, 512)  0           vgg16_filter_11_conv_0[0][0]     
                                                                 vgg16_filter_11_conv_1[0][0]     
                                                                 vgg16_filter_11_conv_2[0][0]     
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 14, 14, 512)  0           add_16[0][0]                     
__________________________________________________________________________________________________
lambda_27 (Lambda)              [(None, 14, 14, 170) 0           activation_16[0][0]              
__________________________________________________________________________________________________
vgg16_filter_12_conv_0 (Conv2D) (None, 14, 14, 512)  783360      lambda_27[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_12_conv_1 (Conv2D) (None, 14, 14, 512)  783360      lambda_27[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_12_conv_2 (Conv2D) (None, 14, 14, 512)  793088      lambda_27[0][2]                  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 14, 14, 512)  0           vgg16_filter_12_conv_0[0][0]     
                                                                 vgg16_filter_12_conv_1[0][0]     
                                                                 vgg16_filter_12_conv_2[0][0]     
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 14, 14, 512)  0           add_17[0][0]                     
__________________________________________________________________________________________________
lambda_28 (Lambda)              [(None, 14, 14, 170) 0           activation_17[0][0]              
__________________________________________________________________________________________________
vgg16_filter_13_conv_0 (Conv2D) (None, 14, 14, 512)  783360      lambda_28[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_13_conv_1 (Conv2D) (None, 14, 14, 512)  783360      lambda_28[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_13_conv_2 (Conv2D) (None, 14, 14, 512)  793088      lambda_28[0][2]                  
__________________________________________________________________________________________________
add_18 (Add)                    (None, 14, 14, 512)  0           vgg16_filter_13_conv_0[0][0]     
                                                                 vgg16_filter_13_conv_1[0][0]     
                                                                 vgg16_filter_13_conv_2[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 14, 14, 512)  0           add_18[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 7, 7, 512)    0           activation_18[0][0]              
__________________________________________________________________________________________________
flatten (Flatten)               (None, 25088)        0           max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
vgg16_filter_13_dense (Dense)   (None, 4096)         102764544   flatten[0][0]                    
__________________________________________________________________________________________________
vgg16_filter_14_dense (Dense)   (None, 4096)         16781312    vgg16_filter_13_dense[0][0]      
__________________________________________________________________________________________________
vgg16_filter_15_dense (Dense)   (None, 1000)         4097000     vgg16_filter_14_dense[0][0]      
==================================================================================================
Total params: 138,357,544
Trainable params: 138,357,544
Non-trainable params: 0
__________________________________________________________________________________________________
None
