__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               [(None, 220, 220, 1) 0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 220, 220, 64) 640         lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 220, 220, 64) 640         lambda_1[0][1]                   
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 220, 220, 64) 640         lambda_1[0][2]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 220, 220, 64) 0           conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               [(None, 220, 220, 21 0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 220, 220, 64) 12160       lambda_2[0][0]                   
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 220, 220, 64) 12160       lambda_2[0][1]                   
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 220, 220, 64) 12736       lambda_2[0][2]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 220, 220, 64) 0           conv2d_17[0][0]                  
                                                                 conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 110, 110, 64) 0           add_2[0][0]                      
__________________________________________________________________________________________________
lambda_3 (Lambda)               [(None, 110, 110, 21 0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 110, 110, 128 24320       lambda_3[0][0]                   
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 110, 110, 128 24320       lambda_3[0][1]                   
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 110, 110, 128 25472       lambda_3[0][2]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 110, 110, 128 0           conv2d_20[0][0]                  
                                                                 conv2d_21[0][0]                  
                                                                 conv2d_22[0][0]                  
__________________________________________________________________________________________________
lambda_4 (Lambda)               [(None, 110, 110, 42 0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 110, 110, 128 48512       lambda_4[0][0]                   
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 110, 110, 128 48512       lambda_4[0][1]                   
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 110, 110, 128 50816       lambda_4[0][2]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 110, 110, 128 0           conv2d_23[0][0]                  
                                                                 conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 55, 55, 128)  0           add_4[0][0]                      
__________________________________________________________________________________________________
lambda_5 (Lambda)               [(None, 55, 55, 42), 0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 55, 55, 256)  97024       lambda_5[0][0]                   
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 55, 55, 256)  97024       lambda_5[0][1]                   
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 55, 55, 256)  101632      lambda_5[0][2]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 55, 55, 256)  0           conv2d_26[0][0]                  
                                                                 conv2d_27[0][0]                  
                                                                 conv2d_28[0][0]                  
__________________________________________________________________________________________________
lambda_6 (Lambda)               [(None, 55, 55, 85), 0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 55, 55, 256)  196096      lambda_6[0][0]                   
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 55, 55, 256)  196096      lambda_6[0][1]                   
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 55, 55, 256)  198400      lambda_6[0][2]                   
__________________________________________________________________________________________________
add_6 (Add)                     (None, 55, 55, 256)  0           conv2d_29[0][0]                  
                                                                 conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
lambda_7 (Lambda)               [(None, 55, 55, 85), 0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 55, 55, 256)  196096      lambda_7[0][0]                   
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 55, 55, 256)  196096      lambda_7[0][1]                   
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 55, 55, 256)  198400      lambda_7[0][2]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 55, 55, 256)  0           conv2d_32[0][0]                  
                                                                 conv2d_33[0][0]                  
                                                                 conv2d_34[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 27, 27, 256)  0           add_7[0][0]                      
__________________________________________________________________________________________________
lambda_8 (Lambda)               [(None, 27, 27, 85), 0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 27, 27, 512)  392192      lambda_8[0][0]                   
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 27, 27, 512)  392192      lambda_8[0][1]                   
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 27, 27, 512)  396800      lambda_8[0][2]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 27, 27, 512)  0           conv2d_35[0][0]                  
                                                                 conv2d_36[0][0]                  
                                                                 conv2d_37[0][0]                  
__________________________________________________________________________________________________
lambda_9 (Lambda)               [(None, 27, 27, 170) 0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 27, 27, 512)  783872      lambda_9[0][0]                   
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 27, 27, 512)  783872      lambda_9[0][1]                   
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 27, 27, 512)  793088      lambda_9[0][2]                   
__________________________________________________________________________________________________
add_9 (Add)                     (None, 27, 27, 512)  0           conv2d_38[0][0]                  
                                                                 conv2d_39[0][0]                  
                                                                 conv2d_40[0][0]                  
__________________________________________________________________________________________________
lambda_10 (Lambda)              [(None, 27, 27, 170) 0           add_9[0][0]                      
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 27, 27, 512)  783872      lambda_10[0][0]                  
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 27, 27, 512)  783872      lambda_10[0][1]                  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 27, 27, 512)  793088      lambda_10[0][2]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 27, 27, 512)  0           conv2d_41[0][0]                  
                                                                 conv2d_42[0][0]                  
                                                                 conv2d_43[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 13, 13, 512)  0           add_10[0][0]                     
__________________________________________________________________________________________________
lambda_11 (Lambda)              [(None, 13, 13, 170) 0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 13, 13, 512)  783872      lambda_11[0][0]                  
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 13, 13, 512)  783872      lambda_11[0][1]                  
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 13, 13, 512)  793088      lambda_11[0][2]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 13, 13, 512)  0           conv2d_44[0][0]                  
                                                                 conv2d_45[0][0]                  
                                                                 conv2d_46[0][0]                  
__________________________________________________________________________________________________
lambda_12 (Lambda)              [(None, 13, 13, 170) 0           add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 13, 13, 512)  783872      lambda_12[0][0]                  
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 13, 13, 512)  783872      lambda_12[0][1]                  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 13, 13, 512)  793088      lambda_12[0][2]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 13, 13, 512)  0           conv2d_47[0][0]                  
                                                                 conv2d_48[0][0]                  
                                                                 conv2d_49[0][0]                  
__________________________________________________________________________________________________
lambda_13 (Lambda)              [(None, 13, 13, 170) 0           add_12[0][0]                     
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 13, 13, 512)  783872      lambda_13[0][0]                  
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 13, 13, 512)  783872      lambda_13[0][1]                  
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 13, 13, 512)  793088      lambda_13[0][2]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 13, 13, 512)  0           conv2d_50[0][0]                  
                                                                 conv2d_51[0][0]                  
                                                                 conv2d_52[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 6, 6, 512)    0           add_13[0][0]                     
__________________________________________________________________________________________________
flatten (Flatten)               (None, 18432)        0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 4096)         75501568    flatten[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 4096)         16781312    dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1000)         4097000     dense_5[0][0]                    
==================================================================================================
Total params: 111,103,016
Trainable params: 111,103,016
Non-trainable params: 0
__________________________________________________________________________________________________
None
