__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               [(None, 220, 220, 1) 0           input_2[0][0]                    
__________________________________________________________________________________________________
vgg16_filter_1_conv_0 (Conv2D)  (None, 220, 220, 64) 576         lambda_1[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_1_conv_1 (Conv2D)  (None, 220, 220, 64) 576         lambda_1[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_1_conv_2 (Conv2D)  (None, 220, 220, 64) 640         lambda_1[0][2]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 220, 220, 64) 0           vgg16_filter_1_conv_0[0][0]      
                                                                 vgg16_filter_1_conv_1[0][0]      
                                                                 vgg16_filter_1_conv_2[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 220, 220, 64) 0           add_1[0][0]                      
__________________________________________________________________________________________________
lambda_2 (Lambda)               [(None, 220, 220, 21 0           activation_1[0][0]               
__________________________________________________________________________________________________
vgg16_filter_2_conv_0 (Conv2D)  (None, 220, 220, 64) 12096       lambda_2[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_2_conv_1 (Conv2D)  (None, 220, 220, 64) 12096       lambda_2[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_2_conv_2 (Conv2D)  (None, 220, 220, 64) 12736       lambda_2[0][2]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 220, 220, 64) 0           vgg16_filter_2_conv_0[0][0]      
                                                                 vgg16_filter_2_conv_1[0][0]      
                                                                 vgg16_filter_2_conv_2[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 220, 220, 64) 0           add_2[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 110, 110, 64) 0           activation_2[0][0]               
__________________________________________________________________________________________________
lambda_3 (Lambda)               [(None, 110, 110, 21 0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
vgg16_filter_3_conv_0 (Conv2D)  (None, 110, 110, 128 24192       lambda_3[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_3_conv_1 (Conv2D)  (None, 110, 110, 128 24192       lambda_3[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_3_conv_2 (Conv2D)  (None, 110, 110, 128 25472       lambda_3[0][2]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 110, 110, 128 0           vgg16_filter_3_conv_0[0][0]      
                                                                 vgg16_filter_3_conv_1[0][0]      
                                                                 vgg16_filter_3_conv_2[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 110, 110, 128 0           add_3[0][0]                      
__________________________________________________________________________________________________
lambda_4 (Lambda)               [(None, 110, 110, 42 0           activation_3[0][0]               
__________________________________________________________________________________________________
vgg16_filter_4_conv_0 (Conv2D)  (None, 110, 110, 128 48384       lambda_4[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_4_conv_1 (Conv2D)  (None, 110, 110, 128 48384       lambda_4[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_4_conv_2 (Conv2D)  (None, 110, 110, 128 50816       lambda_4[0][2]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 110, 110, 128 0           vgg16_filter_4_conv_0[0][0]      
                                                                 vgg16_filter_4_conv_1[0][0]      
                                                                 vgg16_filter_4_conv_2[0][0]      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 110, 110, 128 0           add_4[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 55, 55, 128)  0           activation_4[0][0]               
__________________________________________________________________________________________________
lambda_5 (Lambda)               [(None, 55, 55, 42), 0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
vgg16_filter_5_conv_0 (Conv2D)  (None, 55, 55, 256)  96768       lambda_5[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_5_conv_1 (Conv2D)  (None, 55, 55, 256)  96768       lambda_5[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_5_conv_2 (Conv2D)  (None, 55, 55, 256)  101632      lambda_5[0][2]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 55, 55, 256)  0           vgg16_filter_5_conv_0[0][0]      
                                                                 vgg16_filter_5_conv_1[0][0]      
                                                                 vgg16_filter_5_conv_2[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 55, 55, 256)  0           add_5[0][0]                      
__________________________________________________________________________________________________
lambda_6 (Lambda)               [(None, 55, 55, 85), 0           activation_5[0][0]               
__________________________________________________________________________________________________
vgg16_filter_6_conv_0 (Conv2D)  (None, 55, 55, 256)  195840      lambda_6[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_6_conv_1 (Conv2D)  (None, 55, 55, 256)  195840      lambda_6[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_6_conv_2 (Conv2D)  (None, 55, 55, 256)  198400      lambda_6[0][2]                   
__________________________________________________________________________________________________
add_6 (Add)                     (None, 55, 55, 256)  0           vgg16_filter_6_conv_0[0][0]      
                                                                 vgg16_filter_6_conv_1[0][0]      
                                                                 vgg16_filter_6_conv_2[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 55, 55, 256)  0           add_6[0][0]                      
__________________________________________________________________________________________________
lambda_7 (Lambda)               [(None, 55, 55, 85), 0           activation_6[0][0]               
__________________________________________________________________________________________________
vgg16_filter_7_conv_0 (Conv2D)  (None, 55, 55, 256)  195840      lambda_7[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_7_conv_1 (Conv2D)  (None, 55, 55, 256)  195840      lambda_7[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_7_conv_2 (Conv2D)  (None, 55, 55, 256)  198400      lambda_7[0][2]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 55, 55, 256)  0           vgg16_filter_7_conv_0[0][0]      
                                                                 vgg16_filter_7_conv_1[0][0]      
                                                                 vgg16_filter_7_conv_2[0][0]      
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 55, 55, 256)  0           add_7[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 27, 27, 256)  0           activation_7[0][0]               
__________________________________________________________________________________________________
lambda_8 (Lambda)               [(None, 27, 27, 85), 0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
vgg16_filter_8_conv_0 (Conv2D)  (None, 27, 27, 512)  391680      lambda_8[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_8_conv_1 (Conv2D)  (None, 27, 27, 512)  391680      lambda_8[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_8_conv_2 (Conv2D)  (None, 27, 27, 512)  396800      lambda_8[0][2]                   
__________________________________________________________________________________________________
add_8 (Add)                     (None, 27, 27, 512)  0           vgg16_filter_8_conv_0[0][0]      
                                                                 vgg16_filter_8_conv_1[0][0]      
                                                                 vgg16_filter_8_conv_2[0][0]      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 27, 27, 512)  0           add_8[0][0]                      
__________________________________________________________________________________________________
lambda_9 (Lambda)               [(None, 27, 27, 170) 0           activation_8[0][0]               
__________________________________________________________________________________________________
vgg16_filter_9_conv_0 (Conv2D)  (None, 27, 27, 512)  783360      lambda_9[0][0]                   
__________________________________________________________________________________________________
vgg16_filter_9_conv_1 (Conv2D)  (None, 27, 27, 512)  783360      lambda_9[0][1]                   
__________________________________________________________________________________________________
vgg16_filter_9_conv_2 (Conv2D)  (None, 27, 27, 512)  793088      lambda_9[0][2]                   
__________________________________________________________________________________________________
add_9 (Add)                     (None, 27, 27, 512)  0           vgg16_filter_9_conv_0[0][0]      
                                                                 vgg16_filter_9_conv_1[0][0]      
                                                                 vgg16_filter_9_conv_2[0][0]      
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 27, 27, 512)  0           add_9[0][0]                      
__________________________________________________________________________________________________
lambda_10 (Lambda)              [(None, 27, 27, 170) 0           activation_9[0][0]               
__________________________________________________________________________________________________
vgg16_filter_10_conv_0 (Conv2D) (None, 27, 27, 512)  783360      lambda_10[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_10_conv_1 (Conv2D) (None, 27, 27, 512)  783360      lambda_10[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_10_conv_2 (Conv2D) (None, 27, 27, 512)  793088      lambda_10[0][2]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 27, 27, 512)  0           vgg16_filter_10_conv_0[0][0]     
                                                                 vgg16_filter_10_conv_1[0][0]     
                                                                 vgg16_filter_10_conv_2[0][0]     
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 27, 27, 512)  0           add_10[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 13, 13, 512)  0           activation_10[0][0]              
__________________________________________________________________________________________________
lambda_11 (Lambda)              [(None, 13, 13, 170) 0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
vgg16_filter_11_conv_0 (Conv2D) (None, 13, 13, 512)  783360      lambda_11[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_11_conv_1 (Conv2D) (None, 13, 13, 512)  783360      lambda_11[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_11_conv_2 (Conv2D) (None, 13, 13, 512)  793088      lambda_11[0][2]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 13, 13, 512)  0           vgg16_filter_11_conv_0[0][0]     
                                                                 vgg16_filter_11_conv_1[0][0]     
                                                                 vgg16_filter_11_conv_2[0][0]     
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 13, 13, 512)  0           add_11[0][0]                     
__________________________________________________________________________________________________
lambda_12 (Lambda)              [(None, 13, 13, 170) 0           activation_11[0][0]              
__________________________________________________________________________________________________
vgg16_filter_12_conv_0 (Conv2D) (None, 13, 13, 512)  783360      lambda_12[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_12_conv_1 (Conv2D) (None, 13, 13, 512)  783360      lambda_12[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_12_conv_2 (Conv2D) (None, 13, 13, 512)  793088      lambda_12[0][2]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 13, 13, 512)  0           vgg16_filter_12_conv_0[0][0]     
                                                                 vgg16_filter_12_conv_1[0][0]     
                                                                 vgg16_filter_12_conv_2[0][0]     
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 13, 13, 512)  0           add_12[0][0]                     
__________________________________________________________________________________________________
lambda_13 (Lambda)              [(None, 13, 13, 170) 0           activation_12[0][0]              
__________________________________________________________________________________________________
vgg16_filter_13_conv_0 (Conv2D) (None, 13, 13, 512)  783360      lambda_13[0][0]                  
__________________________________________________________________________________________________
vgg16_filter_13_conv_1 (Conv2D) (None, 13, 13, 512)  783360      lambda_13[0][1]                  
__________________________________________________________________________________________________
vgg16_filter_13_conv_2 (Conv2D) (None, 13, 13, 512)  793088      lambda_13[0][2]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 13, 13, 512)  0           vgg16_filter_13_conv_0[0][0]     
                                                                 vgg16_filter_13_conv_1[0][0]     
                                                                 vgg16_filter_13_conv_2[0][0]     
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 13, 13, 512)  0           add_13[0][0]                     
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 6, 6, 512)    0           activation_13[0][0]              
__________________________________________________________________________________________________
flatten (Flatten)               (None, 18432)        0           max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
vgg16_filter_14_dense (Dense)   (None, 4096)         75501568    flatten[0][0]                    
__________________________________________________________________________________________________
vgg16_filter_15_dense (Dense)   (None, 4096)         16781312    vgg16_filter_14_dense[0][0]      
__________________________________________________________________________________________________
vgg16_filter_16_dense (Dense)   (None, 1000)         4097000     vgg16_filter_15_dense[0][0]      
==================================================================================================
Total params: 111,094,568
Trainable params: 111,094,568
Non-trainable params: 0
__________________________________________________________________________________________________
None
