_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 220, 220, 3)       0         
_________________________________________________________________
vgg16_original_1_conv (Conv2 (None, 220, 220, 64)      1792      
_________________________________________________________________
vgg16_original_2_conv (Conv2 (None, 220, 220, 64)      36928     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 110, 110, 64)      0         
_________________________________________________________________
vgg16_original_3_conv (Conv2 (None, 110, 110, 128)     73856     
_________________________________________________________________
vgg16_original_4_conv (Conv2 (None, 110, 110, 128)     147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 55, 55, 128)       0         
_________________________________________________________________
vgg16_original_5_conv (Conv2 (None, 55, 55, 256)       295168    
_________________________________________________________________
vgg16_original_6_conv (Conv2 (None, 55, 55, 256)       590080    
_________________________________________________________________
vgg16_original_7_conv (Conv2 (None, 55, 55, 256)       590080    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 27, 27, 256)       0         
_________________________________________________________________
vgg16_original_8_conv (Conv2 (None, 27, 27, 512)       1180160   
_________________________________________________________________
vgg16_original_9_conv (Conv2 (None, 27, 27, 512)       2359808   
_________________________________________________________________
vgg16_original_10_conv (Conv (None, 27, 27, 512)       2359808   
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 13, 13, 512)       0         
_________________________________________________________________
vgg16_original_11_conv (Conv (None, 13, 13, 512)       2359808   
_________________________________________________________________
vgg16_original_12_conv (Conv (None, 13, 13, 512)       2359808   
_________________________________________________________________
vgg16_original_13_conv (Conv (None, 13, 13, 512)       2359808   
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 6, 6, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 18432)             0         
_________________________________________________________________
vgg16_original_14_dense (Den (None, 4096)              75501568  
_________________________________________________________________
vgg16_original_15_dense (Den (None, 4096)              16781312  
_________________________________________________________________
vgg16_original_16_dense (Den (None, 1000)              4097000   
=================================================================
Total params: 111,094,568
Trainable params: 111,094,568
Non-trainable params: 0
_________________________________________________________________
None
