__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_13 (InputLayer)           (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
conv2d_569 (Conv2D)             (None, 111, 111, 32) 864         input_13[0][0]                   
__________________________________________________________________________________________________
conv2d_570 (Conv2D)             (None, 109, 109, 64) 18432       conv2d_569[0][0]                 
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 109, 109, 128 8768        conv2d_570[0][0]                 
__________________________________________________________________________________________________
activation_65 (Activation)      (None, 109, 109, 128 0           separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 109, 109, 128 17536       activation_65[0][0]              
__________________________________________________________________________________________________
max_pooling2d_33 (MaxPooling2D) (None, 55, 55, 128)  0           separable_conv2d_2[0][0]         
__________________________________________________________________________________________________
conv2d_571 (Conv2D)             (None, 55, 55, 128)  8192        conv2d_570[0][0]                 
__________________________________________________________________________________________________
add_136 (Add)                   (None, 55, 55, 128)  0           max_pooling2d_33[0][0]           
                                                                 conv2d_571[0][0]                 
__________________________________________________________________________________________________
activation_66 (Activation)      (None, 55, 55, 128)  0           add_136[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 55, 55, 256)  33920       activation_66[0][0]              
__________________________________________________________________________________________________
activation_67 (Activation)      (None, 55, 55, 256)  0           separable_conv2d_3[0][0]         
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 55, 55, 256)  67840       activation_67[0][0]              
__________________________________________________________________________________________________
max_pooling2d_34 (MaxPooling2D) (None, 28, 28, 256)  0           separable_conv2d_4[0][0]         
__________________________________________________________________________________________________
conv2d_572 (Conv2D)             (None, 28, 28, 256)  32768       add_136[0][0]                    
__________________________________________________________________________________________________
add_137 (Add)                   (None, 28, 28, 256)  0           max_pooling2d_34[0][0]           
                                                                 conv2d_572[0][0]                 
__________________________________________________________________________________________________
activation_68 (Activation)      (None, 28, 28, 256)  0           add_137[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 28, 28, 728)  188672      activation_68[0][0]              
__________________________________________________________________________________________________
activation_69 (Activation)      (None, 28, 28, 728)  0           separable_conv2d_5[0][0]         
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 28, 28, 728)  536536      activation_69[0][0]              
__________________________________________________________________________________________________
max_pooling2d_35 (MaxPooling2D) (None, 14, 14, 728)  0           separable_conv2d_6[0][0]         
__________________________________________________________________________________________________
conv2d_573 (Conv2D)             (None, 14, 14, 728)  186368      add_137[0][0]                    
__________________________________________________________________________________________________
add_138 (Add)                   (None, 14, 14, 728)  0           max_pooling2d_35[0][0]           
                                                                 conv2d_573[0][0]                 
__________________________________________________________________________________________________
activation_70 (Activation)      (None, 14, 14, 728)  0           add_138[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_7 (SeparableCo (None, 14, 14, 728)  536536      activation_70[0][0]              
__________________________________________________________________________________________________
activation_71 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_7[0][0]         
__________________________________________________________________________________________________
separable_conv2d_8 (SeparableCo (None, 14, 14, 728)  536536      activation_71[0][0]              
__________________________________________________________________________________________________
activation_72 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_8[0][0]         
__________________________________________________________________________________________________
separable_conv2d_9 (SeparableCo (None, 14, 14, 728)  536536      activation_72[0][0]              
__________________________________________________________________________________________________
add_139 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_9[0][0]         
                                                                 add_138[0][0]                    
__________________________________________________________________________________________________
activation_73 (Activation)      (None, 14, 14, 728)  0           add_139[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_10 (SeparableC (None, 14, 14, 728)  536536      activation_73[0][0]              
__________________________________________________________________________________________________
activation_74 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_10[0][0]        
__________________________________________________________________________________________________
separable_conv2d_11 (SeparableC (None, 14, 14, 728)  536536      activation_74[0][0]              
__________________________________________________________________________________________________
activation_75 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_11[0][0]        
__________________________________________________________________________________________________
separable_conv2d_12 (SeparableC (None, 14, 14, 728)  536536      activation_75[0][0]              
__________________________________________________________________________________________________
add_140 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_12[0][0]        
                                                                 add_139[0][0]                    
__________________________________________________________________________________________________
activation_76 (Activation)      (None, 14, 14, 728)  0           add_140[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_13 (SeparableC (None, 14, 14, 728)  536536      activation_76[0][0]              
__________________________________________________________________________________________________
activation_77 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_13[0][0]        
__________________________________________________________________________________________________
separable_conv2d_14 (SeparableC (None, 14, 14, 728)  536536      activation_77[0][0]              
__________________________________________________________________________________________________
activation_78 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_14[0][0]        
__________________________________________________________________________________________________
separable_conv2d_15 (SeparableC (None, 14, 14, 728)  536536      activation_78[0][0]              
__________________________________________________________________________________________________
add_141 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_15[0][0]        
                                                                 add_140[0][0]                    
__________________________________________________________________________________________________
activation_79 (Activation)      (None, 14, 14, 728)  0           add_141[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_16 (SeparableC (None, 14, 14, 728)  536536      activation_79[0][0]              
__________________________________________________________________________________________________
activation_80 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_16[0][0]        
__________________________________________________________________________________________________
separable_conv2d_17 (SeparableC (None, 14, 14, 728)  536536      activation_80[0][0]              
__________________________________________________________________________________________________
activation_81 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_17[0][0]        
__________________________________________________________________________________________________
separable_conv2d_18 (SeparableC (None, 14, 14, 728)  536536      activation_81[0][0]              
__________________________________________________________________________________________________
add_142 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_18[0][0]        
                                                                 add_141[0][0]                    
__________________________________________________________________________________________________
activation_82 (Activation)      (None, 14, 14, 728)  0           add_142[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_19 (SeparableC (None, 14, 14, 728)  536536      activation_82[0][0]              
__________________________________________________________________________________________________
activation_83 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_19[0][0]        
__________________________________________________________________________________________________
separable_conv2d_20 (SeparableC (None, 14, 14, 728)  536536      activation_83[0][0]              
__________________________________________________________________________________________________
activation_84 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_20[0][0]        
__________________________________________________________________________________________________
separable_conv2d_21 (SeparableC (None, 14, 14, 728)  536536      activation_84[0][0]              
__________________________________________________________________________________________________
add_143 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_21[0][0]        
                                                                 add_142[0][0]                    
__________________________________________________________________________________________________
activation_85 (Activation)      (None, 14, 14, 728)  0           add_143[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_22 (SeparableC (None, 14, 14, 728)  536536      activation_85[0][0]              
__________________________________________________________________________________________________
activation_86 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_22[0][0]        
__________________________________________________________________________________________________
separable_conv2d_23 (SeparableC (None, 14, 14, 728)  536536      activation_86[0][0]              
__________________________________________________________________________________________________
activation_87 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_23[0][0]        
__________________________________________________________________________________________________
separable_conv2d_24 (SeparableC (None, 14, 14, 728)  536536      activation_87[0][0]              
__________________________________________________________________________________________________
add_144 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_24[0][0]        
                                                                 add_143[0][0]                    
__________________________________________________________________________________________________
activation_88 (Activation)      (None, 14, 14, 728)  0           add_144[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_25 (SeparableC (None, 14, 14, 728)  536536      activation_88[0][0]              
__________________________________________________________________________________________________
activation_89 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_25[0][0]        
__________________________________________________________________________________________________
separable_conv2d_26 (SeparableC (None, 14, 14, 728)  536536      activation_89[0][0]              
__________________________________________________________________________________________________
activation_90 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_26[0][0]        
__________________________________________________________________________________________________
separable_conv2d_27 (SeparableC (None, 14, 14, 728)  536536      activation_90[0][0]              
__________________________________________________________________________________________________
add_145 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_27[0][0]        
                                                                 add_144[0][0]                    
__________________________________________________________________________________________________
activation_91 (Activation)      (None, 14, 14, 728)  0           add_145[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_28 (SeparableC (None, 14, 14, 728)  536536      activation_91[0][0]              
__________________________________________________________________________________________________
activation_92 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_28[0][0]        
__________________________________________________________________________________________________
separable_conv2d_29 (SeparableC (None, 14, 14, 728)  536536      activation_92[0][0]              
__________________________________________________________________________________________________
activation_93 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_29[0][0]        
__________________________________________________________________________________________________
separable_conv2d_30 (SeparableC (None, 14, 14, 728)  536536      activation_93[0][0]              
__________________________________________________________________________________________________
add_146 (Add)                   (None, 14, 14, 728)  0           separable_conv2d_30[0][0]        
                                                                 add_145[0][0]                    
__________________________________________________________________________________________________
activation_94 (Activation)      (None, 14, 14, 728)  0           add_146[0][0]                    
__________________________________________________________________________________________________
separable_conv2d_31 (SeparableC (None, 14, 14, 728)  536536      activation_94[0][0]              
__________________________________________________________________________________________________
activation_95 (Activation)      (None, 14, 14, 728)  0           separable_conv2d_31[0][0]        
__________________________________________________________________________________________________
separable_conv2d_32 (SeparableC (None, 14, 14, 1024) 752024      activation_95[0][0]              
__________________________________________________________________________________________________
max_pooling2d_36 (MaxPooling2D) (None, 7, 7, 1024)   0           separable_conv2d_32[0][0]        
__________________________________________________________________________________________________
conv2d_574 (Conv2D)             (None, 7, 7, 1024)   745472      add_146[0][0]                    
__________________________________________________________________________________________________
add_147 (Add)                   (None, 7, 7, 1024)   0           max_pooling2d_36[0][0]           
                                                                 conv2d_574[0][0]                 
__________________________________________________________________________________________________
separable_conv2d_33 (SeparableC (None, 7, 7, 1536)   1582080     add_147[0][0]                    
__________________________________________________________________________________________________
activation_96 (Activation)      (None, 7, 7, 1536)   0           separable_conv2d_33[0][0]        
__________________________________________________________________________________________________
separable_conv2d_34 (SeparableC (None, 7, 7, 2048)   3159552     activation_96[0][0]              
__________________________________________________________________________________________________
activation_97 (Activation)      (None, 7, 7, 2048)   0           separable_conv2d_34[0][0]        
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           activation_97[0][0]              
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 1000)         2049000     global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 22,801,424
Trainable params: 22,801,424
Non-trainable params: 0
__________________________________________________________________________________________________
None
