__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               [(None, 220, 220, 1) 0           input_2[0][0]                    
__________________________________________________________________________________________________
alexnet_filter_1_conv_0 (Conv2D (None, 55, 55, 48)   5808        lambda_1[0][0]                   
__________________________________________________________________________________________________
alexnet_filter_1_conv_1 (Conv2D (None, 55, 55, 48)   5808        lambda_1[0][1]                   
__________________________________________________________________________________________________
alexnet_filter_1_conv_2 (Conv2D (None, 55, 55, 48)   5856        lambda_1[0][2]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 55, 55, 48)   0           alexnet_filter_1_conv_0[0][0]    
                                                                 alexnet_filter_1_conv_1[0][0]    
                                                                 alexnet_filter_1_conv_2[0][0]    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 55, 55, 48)   0           add_1[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 27, 27, 48)   0           activation_1[0][0]               
__________________________________________________________________________________________________
lambda_2 (Lambda)               [(None, 27, 27, 16), 0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
alexnet_filter_2_conv_0 (Conv2D (None, 27, 27, 128)  51200       lambda_2[0][0]                   
__________________________________________________________________________________________________
alexnet_filter_2_conv_1 (Conv2D (None, 27, 27, 128)  51200       lambda_2[0][1]                   
__________________________________________________________________________________________________
alexnet_filter_2_conv_2 (Conv2D (None, 27, 27, 128)  51328       lambda_2[0][2]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 27, 27, 128)  0           alexnet_filter_2_conv_0[0][0]    
                                                                 alexnet_filter_2_conv_1[0][0]    
                                                                 alexnet_filter_2_conv_2[0][0]    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 27, 27, 128)  0           add_2[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 13, 13, 128)  0           activation_2[0][0]               
__________________________________________________________________________________________________
lambda_3 (Lambda)               [(None, 13, 13, 42), 0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
alexnet_filter_3_conv_0 (Conv2D (None, 13, 13, 192)  72576       lambda_3[0][0]                   
__________________________________________________________________________________________________
alexnet_filter_3_conv_1 (Conv2D (None, 13, 13, 192)  72576       lambda_3[0][1]                   
__________________________________________________________________________________________________
alexnet_filter_3_conv_2 (Conv2D (None, 13, 13, 192)  76224       lambda_3[0][2]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 13, 13, 192)  0           alexnet_filter_3_conv_0[0][0]    
                                                                 alexnet_filter_3_conv_1[0][0]    
                                                                 alexnet_filter_3_conv_2[0][0]    
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 13, 13, 192)  0           add_3[0][0]                      
__________________________________________________________________________________________________
lambda_4 (Lambda)               [(None, 13, 13, 64), 0           activation_3[0][0]               
__________________________________________________________________________________________________
alexnet_filter_4_conv_0 (Conv2D (None, 13, 13, 192)  110592      lambda_4[0][0]                   
__________________________________________________________________________________________________
alexnet_filter_4_conv_1 (Conv2D (None, 13, 13, 192)  110592      lambda_4[0][1]                   
__________________________________________________________________________________________________
alexnet_filter_4_conv_2 (Conv2D (None, 13, 13, 192)  110784      lambda_4[0][2]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 13, 13, 192)  0           alexnet_filter_4_conv_0[0][0]    
                                                                 alexnet_filter_4_conv_1[0][0]    
                                                                 alexnet_filter_4_conv_2[0][0]    
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 13, 13, 192)  0           add_4[0][0]                      
__________________________________________________________________________________________________
lambda_5 (Lambda)               [(None, 13, 13, 64), 0           activation_4[0][0]               
__________________________________________________________________________________________________
alexnet_filter_5_conv_0 (Conv2D (None, 13, 13, 128)  73728       lambda_5[0][0]                   
__________________________________________________________________________________________________
alexnet_filter_5_conv_1 (Conv2D (None, 13, 13, 128)  73728       lambda_5[0][1]                   
__________________________________________________________________________________________________
alexnet_filter_5_conv_2 (Conv2D (None, 13, 13, 128)  73856       lambda_5[0][2]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 13, 13, 128)  0           alexnet_filter_5_conv_0[0][0]    
                                                                 alexnet_filter_5_conv_1[0][0]    
                                                                 alexnet_filter_5_conv_2[0][0]    
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 13, 13, 128)  0           add_5[0][0]                      
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 6, 6, 128)    0           activation_5[0][0]               
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4608)         0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
alexnet_filter_6_dense (Dense)  (None, 4096)         18878464    flatten_2[0][0]                  
__________________________________________________________________________________________________
alexnet_filter_7_dense (Dense)  (None, 4096)         16781312    alexnet_filter_6_dense[0][0]     
__________________________________________________________________________________________________
alexnet_filter_8_dense (Dense)  (None, 1000)         4097000     alexnet_filter_7_dense[0][0]     
==================================================================================================
Total params: 40,702,632
Trainable params: 40,702,632
Non-trainable params: 0
__________________________________________________________________________________________________
None
