__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_1 (Lambda)               [(None, 220, 220, 1) 0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 55, 55, 48)   5856        lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 55, 55, 48)   5856        lambda_1[0][1]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 55, 55, 48)   5856        lambda_1[0][2]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 55, 55, 48)   0           conv2d_6[0][0]                   
                                                                 conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 27, 27, 48)   0           add_1[0][0]                      
__________________________________________________________________________________________________
lambda_2 (Lambda)               [(None, 27, 27, 16), 0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 27, 27, 128)  51328       lambda_2[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 27, 27, 128)  51328       lambda_2[0][1]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 27, 27, 128)  51328       lambda_2[0][2]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 27, 27, 128)  0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 13, 13, 128)  0           add_2[0][0]                      
__________________________________________________________________________________________________
lambda_3 (Lambda)               [(None, 13, 13, 42), 0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 13, 13, 192)  72768       lambda_3[0][0]                   
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 13, 13, 192)  72768       lambda_3[0][1]                   
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 13, 13, 192)  76224       lambda_3[0][2]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 13, 13, 192)  0           conv2d_12[0][0]                  
                                                                 conv2d_13[0][0]                  
                                                                 conv2d_14[0][0]                  
__________________________________________________________________________________________________
lambda_4 (Lambda)               [(None, 13, 13, 64), 0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 13, 13, 192)  110784      lambda_4[0][0]                   
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 13, 13, 192)  110784      lambda_4[0][1]                   
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 13, 13, 192)  110784      lambda_4[0][2]                   
__________________________________________________________________________________________________
add_4 (Add)                     (None, 13, 13, 192)  0           conv2d_15[0][0]                  
                                                                 conv2d_16[0][0]                  
                                                                 conv2d_17[0][0]                  
__________________________________________________________________________________________________
lambda_5 (Lambda)               [(None, 13, 13, 64), 0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 13, 13, 128)  73856       lambda_5[0][0]                   
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 13, 13, 128)  73856       lambda_5[0][1]                   
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 13, 13, 128)  73856       lambda_5[0][2]                   
__________________________________________________________________________________________________
add_5 (Add)                     (None, 13, 13, 128)  0           conv2d_18[0][0]                  
                                                                 conv2d_19[0][0]                  
                                                                 conv2d_20[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 6, 6, 128)    0           add_5[0][0]                      
__________________________________________________________________________________________________
flatten_2 (Flatten)             (None, 4608)         0           max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 4096)         18878464    flatten_2[0][0]                  
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 4096)         16781312    dense_4[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1000)         4097000     dense_5[0][0]                    
==================================================================================================
Total params: 40,704,008
Trainable params: 40,704,008
Non-trainable params: 0
__________________________________________________________________________________________________
None
