__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_6 (Lambda)               [(None, 220, 220, 3) 0           input_3[0][0]                    
__________________________________________________________________________________________________
alexnet_channel_1_conv_0 (Conv2 (None, 55, 55, 16)   5824        lambda_6[0][0]                   
__________________________________________________________________________________________________
alexnet_channel_1_conv_1 (Conv2 (None, 55, 55, 16)   5824        lambda_6[0][1]                   
__________________________________________________________________________________________________
alexnet_channel_1_conv_2 (Conv2 (None, 55, 55, 16)   5824        lambda_6[0][2]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 55, 55, 48)   0           alexnet_channel_1_conv_0[0][0]   
                                                                 alexnet_channel_1_conv_1[0][0]   
                                                                 alexnet_channel_1_conv_2[0][0]   
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 27, 27, 48)   0           concatenate_1[0][0]              
__________________________________________________________________________________________________
lambda_7 (Lambda)               [(None, 27, 27, 48), 0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
alexnet_channel_2_conv_0 (Conv2 (None, 27, 27, 42)   50442       lambda_7[0][0]                   
__________________________________________________________________________________________________
alexnet_channel_2_conv_1 (Conv2 (None, 27, 27, 42)   50442       lambda_7[0][1]                   
__________________________________________________________________________________________________
alexnet_channel_2_conv_2 (Conv2 (None, 27, 27, 44)   52844       lambda_7[0][2]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 27, 27, 128)  0           alexnet_channel_2_conv_0[0][0]   
                                                                 alexnet_channel_2_conv_1[0][0]   
                                                                 alexnet_channel_2_conv_2[0][0]   
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 13, 13, 128)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
lambda_8 (Lambda)               [(None, 13, 13, 128) 0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
alexnet_channel_3_conv_0 (Conv2 (None, 13, 13, 64)   73792       lambda_8[0][0]                   
__________________________________________________________________________________________________
alexnet_channel_3_conv_1 (Conv2 (None, 13, 13, 64)   73792       lambda_8[0][1]                   
__________________________________________________________________________________________________
alexnet_channel_3_conv_2 (Conv2 (None, 13, 13, 64)   73792       lambda_8[0][2]                   
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 13, 13, 192)  0           alexnet_channel_3_conv_0[0][0]   
                                                                 alexnet_channel_3_conv_1[0][0]   
                                                                 alexnet_channel_3_conv_2[0][0]   
__________________________________________________________________________________________________
lambda_9 (Lambda)               [(None, 13, 13, 192) 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
alexnet_channel_4_conv_0 (Conv2 (None, 13, 13, 64)   110656      lambda_9[0][0]                   
__________________________________________________________________________________________________
alexnet_channel_4_conv_1 (Conv2 (None, 13, 13, 64)   110656      lambda_9[0][1]                   
__________________________________________________________________________________________________
alexnet_channel_4_conv_2 (Conv2 (None, 13, 13, 64)   110656      lambda_9[0][2]                   
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 13, 13, 192)  0           alexnet_channel_4_conv_0[0][0]   
                                                                 alexnet_channel_4_conv_1[0][0]   
                                                                 alexnet_channel_4_conv_2[0][0]   
__________________________________________________________________________________________________
lambda_10 (Lambda)              [(None, 13, 13, 192) 0           concatenate_4[0][0]              
__________________________________________________________________________________________________
alexnet_channel_5_conv_0 (Conv2 (None, 13, 13, 42)   72618       lambda_10[0][0]                  
__________________________________________________________________________________________________
alexnet_channel_5_conv_1 (Conv2 (None, 13, 13, 42)   72618       lambda_10[0][1]                  
__________________________________________________________________________________________________
alexnet_channel_5_conv_2 (Conv2 (None, 13, 13, 44)   76076       lambda_10[0][2]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 13, 13, 128)  0           alexnet_channel_5_conv_0[0][0]   
                                                                 alexnet_channel_5_conv_1[0][0]   
                                                                 alexnet_channel_5_conv_2[0][0]   
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 6, 6, 128)    0           concatenate_5[0][0]              
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 4608)         0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
alexnet_channel_6_dense (Dense) (None, 4096)         18878464    flatten_3[0][0]                  
__________________________________________________________________________________________________
alexnet_channel_7_dense (Dense) (None, 4096)         16781312    alexnet_channel_6_dense[0][0]    
__________________________________________________________________________________________________
alexnet_channel_8_dense (Dense) (None, 1000)         4097000     alexnet_channel_7_dense[0][0]    
==================================================================================================
Total params: 40,702,632
Trainable params: 40,702,632
Non-trainable params: 0
__________________________________________________________________________________________________
None
