__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_19 (ZeroPadding2 (None, 230, 230, 3)  0           input_9[0][0]                    
__________________________________________________________________________________________________
resnet50_original_1 (Conv2D)    (None, 112, 112, 64) 9472        zero_padding2d_19[0][0]          
__________________________________________________________________________________________________
max_pooling2d_33 (MaxPooling2D) (None, 55, 55, 64)   0           resnet50_original_1[0][0]        
__________________________________________________________________________________________________
resnet50_original_2a_conv (Conv (None, 55, 55, 64)   4160        max_pooling2d_33[0][0]           
__________________________________________________________________________________________________
resnet50_original_2b_conv (Conv (None, 55, 55, 64)   36928       resnet50_original_2a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_2c_conv (Conv (None, 55, 55, 256)  16640       resnet50_original_2b_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_2s_conv (Conv (None, 55, 55, 256)  16640       max_pooling2d_33[0][0]           
__________________________________________________________________________________________________
add_19 (Add)                    (None, 55, 55, 256)  0           resnet50_original_2c_conv[0][0]  
                                                                 resnet50_original_2s_conv[0][0]  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 55, 55, 256)  0           add_19[0][0]                     
__________________________________________________________________________________________________
resnet50_original_3a_conv (Conv (None, 55, 55, 64)   16448       activation_19[0][0]              
__________________________________________________________________________________________________
resnet50_original_3b_conv (Conv (None, 55, 55, 64)   36928       resnet50_original_3a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_3c_conv (Conv (None, 55, 55, 256)  16640       resnet50_original_3b_conv[0][0]  
__________________________________________________________________________________________________
add_20 (Add)                    (None, 55, 55, 256)  0           resnet50_original_3c_conv[0][0]  
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 55, 55, 256)  0           add_20[0][0]                     
__________________________________________________________________________________________________
resnet50_original_4a_conv (Conv (None, 55, 55, 64)   16448       activation_20[0][0]              
__________________________________________________________________________________________________
resnet50_original_4b_conv (Conv (None, 55, 55, 64)   36928       resnet50_original_4a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_4c_conv (Conv (None, 55, 55, 256)  16640       resnet50_original_4b_conv[0][0]  
__________________________________________________________________________________________________
add_21 (Add)                    (None, 55, 55, 256)  0           resnet50_original_4c_conv[0][0]  
                                                                 activation_20[0][0]              
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 55, 55, 256)  0           add_21[0][0]                     
__________________________________________________________________________________________________
resnet50_original_5a_conv (Conv (None, 28, 28, 128)  32896       activation_21[0][0]              
__________________________________________________________________________________________________
resnet50_original_5b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_5a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_5c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_5b_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_5s_conv (Conv (None, 28, 28, 512)  131584      activation_21[0][0]              
__________________________________________________________________________________________________
add_22 (Add)                    (None, 28, 28, 512)  0           resnet50_original_5c_conv[0][0]  
                                                                 resnet50_original_5s_conv[0][0]  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 28, 28, 512)  0           add_22[0][0]                     
__________________________________________________________________________________________________
resnet50_original_6a_conv (Conv (None, 28, 28, 128)  65664       activation_22[0][0]              
__________________________________________________________________________________________________
resnet50_original_6b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_6a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_6c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_6b_conv[0][0]  
__________________________________________________________________________________________________
add_23 (Add)                    (None, 28, 28, 512)  0           resnet50_original_6c_conv[0][0]  
                                                                 activation_22[0][0]              
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 28, 28, 512)  0           add_23[0][0]                     
__________________________________________________________________________________________________
resnet50_original_7a_conv (Conv (None, 28, 28, 128)  65664       activation_23[0][0]              
__________________________________________________________________________________________________
resnet50_original_7b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_7a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_7c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_7b_conv[0][0]  
__________________________________________________________________________________________________
add_24 (Add)                    (None, 28, 28, 512)  0           resnet50_original_7c_conv[0][0]  
                                                                 activation_23[0][0]              
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 28, 28, 512)  0           add_24[0][0]                     
__________________________________________________________________________________________________
resnet50_original_8a_conv (Conv (None, 28, 28, 128)  65664       activation_24[0][0]              
__________________________________________________________________________________________________
resnet50_original_8b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_8a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_8c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_8b_conv[0][0]  
__________________________________________________________________________________________________
add_25 (Add)                    (None, 28, 28, 512)  0           resnet50_original_8c_conv[0][0]  
                                                                 activation_24[0][0]              
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 28, 28, 512)  0           add_25[0][0]                     
__________________________________________________________________________________________________
resnet50_original_9a_conv (Conv (None, 14, 14, 256)  131328      activation_25[0][0]              
__________________________________________________________________________________________________
resnet50_original_9b_conv (Conv (None, 14, 14, 256)  590080      resnet50_original_9a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_9c_conv (Conv (None, 14, 14, 1024) 263168      resnet50_original_9b_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_9s_conv (Conv (None, 14, 14, 1024) 525312      activation_25[0][0]              
__________________________________________________________________________________________________
add_26 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_9c_conv[0][0]  
                                                                 resnet50_original_9s_conv[0][0]  
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 14, 14, 1024) 0           add_26[0][0]                     
__________________________________________________________________________________________________
resnet50_original_10a_conv (Con (None, 14, 14, 256)  262400      activation_26[0][0]              
__________________________________________________________________________________________________
resnet50_original_10b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_10a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_10c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_10b_conv[0][0] 
__________________________________________________________________________________________________
add_27 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_10c_conv[0][0] 
                                                                 activation_26[0][0]              
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 14, 14, 1024) 0           add_27[0][0]                     
__________________________________________________________________________________________________
resnet50_original_11a_conv (Con (None, 14, 14, 256)  262400      activation_27[0][0]              
__________________________________________________________________________________________________
resnet50_original_11b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_11a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_11c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_11b_conv[0][0] 
__________________________________________________________________________________________________
add_28 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_11c_conv[0][0] 
                                                                 activation_27[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 14, 14, 1024) 0           add_28[0][0]                     
__________________________________________________________________________________________________
resnet50_original_12a_conv (Con (None, 14, 14, 256)  262400      activation_28[0][0]              
__________________________________________________________________________________________________
resnet50_original_12b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_12a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_12c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_12b_conv[0][0] 
__________________________________________________________________________________________________
add_29 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_12c_conv[0][0] 
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 14, 14, 1024) 0           add_29[0][0]                     
__________________________________________________________________________________________________
resnet50_original_13a_conv (Con (None, 14, 14, 256)  262400      activation_29[0][0]              
__________________________________________________________________________________________________
resnet50_original_13b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_13a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_13c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_13b_conv[0][0] 
__________________________________________________________________________________________________
add_30 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_13c_conv[0][0] 
                                                                 activation_29[0][0]              
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 14, 14, 1024) 0           add_30[0][0]                     
__________________________________________________________________________________________________
resnet50_original_14a_conv (Con (None, 14, 14, 256)  262400      activation_30[0][0]              
__________________________________________________________________________________________________
resnet50_original_14b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_14a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_14c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_14b_conv[0][0] 
__________________________________________________________________________________________________
add_31 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_14c_conv[0][0] 
                                                                 activation_30[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 14, 14, 1024) 0           add_31[0][0]                     
__________________________________________________________________________________________________
resnet50_original_15a_conv (Con (None, 7, 7, 512)    524800      activation_31[0][0]              
__________________________________________________________________________________________________
resnet50_original_15b_conv (Con (None, 7, 7, 512)    2359808     resnet50_original_15a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_15c_conv (Con (None, 7, 7, 2048)   1050624     resnet50_original_15b_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_15s_conv (Con (None, 7, 7, 2048)   2099200     activation_31[0][0]              
__________________________________________________________________________________________________
add_32 (Add)                    (None, 7, 7, 2048)   0           resnet50_original_15c_conv[0][0] 
                                                                 resnet50_original_15s_conv[0][0] 
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 7, 7, 2048)   0           add_32[0][0]                     
__________________________________________________________________________________________________
resnet50_original_16a_conv (Con (None, 7, 7, 512)    1049088     activation_32[0][0]              
__________________________________________________________________________________________________
resnet50_original_16b_conv (Con (None, 7, 7, 512)    2359808     resnet50_original_16a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_16c_conv (Con (None, 7, 7, 2048)   1050624     resnet50_original_16b_conv[0][0] 
__________________________________________________________________________________________________
add_33 (Add)                    (None, 7, 7, 2048)   0           resnet50_original_16c_conv[0][0] 
                                                                 activation_32[0][0]              
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 7, 7, 2048)   0           add_33[0][0]                     
__________________________________________________________________________________________________
resnet50_original_17a_conv (Con (None, 7, 7, 512)    1049088     activation_33[0][0]              
__________________________________________________________________________________________________
resnet50_original_17b_conv (Con (None, 7, 7, 512)    2359808     resnet50_original_17a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_17c_conv (Con (None, 7, 7, 2048)   1050624     resnet50_original_17b_conv[0][0] 
__________________________________________________________________________________________________
add_34 (Add)                    (None, 7, 7, 2048)   0           resnet50_original_17c_conv[0][0] 
                                                                 activation_33[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 7, 7, 2048)   0           add_34[0][0]                     
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 2048)   0           activation_34[0][0]              
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 2048)         0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
resnet50_original_18_dense (Den (None, 1000)         2049000     flatten_5[0][0]                  
==================================================================================================
Total params: 25,530,472
Trainable params: 25,530,472
Non-trainable params: 0
__________________________________________________________________________________________________
None
