__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_19 (ZeroPadding2 (None, 230, 230, 3)  0           input_9[0][0]                    
__________________________________________________________________________________________________
conv2d_145 (Conv2D)             (None, 112, 112, 64) 9472        zero_padding2d_19[0][0]          
__________________________________________________________________________________________________
max_pooling2d_29 (MaxPooling2D) (None, 55, 55, 64)   0           conv2d_145[0][0]                 
__________________________________________________________________________________________________
conv2d_146 (Conv2D)             (None, 55, 55, 64)   4160        max_pooling2d_29[0][0]           
__________________________________________________________________________________________________
conv2d_147 (Conv2D)             (None, 55, 55, 64)   36928       conv2d_146[0][0]                 
__________________________________________________________________________________________________
conv2d_148 (Conv2D)             (None, 55, 55, 256)  16640       conv2d_147[0][0]                 
__________________________________________________________________________________________________
conv2d_149 (Conv2D)             (None, 55, 55, 256)  16640       max_pooling2d_29[0][0]           
__________________________________________________________________________________________________
add_19 (Add)                    (None, 55, 55, 256)  0           conv2d_148[0][0]                 
                                                                 conv2d_149[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 55, 55, 256)  0           add_19[0][0]                     
__________________________________________________________________________________________________
conv2d_150 (Conv2D)             (None, 55, 55, 64)   16448       activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_151 (Conv2D)             (None, 55, 55, 64)   36928       conv2d_150[0][0]                 
__________________________________________________________________________________________________
conv2d_152 (Conv2D)             (None, 55, 55, 256)  16640       conv2d_151[0][0]                 
__________________________________________________________________________________________________
add_20 (Add)                    (None, 55, 55, 256)  0           conv2d_152[0][0]                 
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 55, 55, 256)  0           add_20[0][0]                     
__________________________________________________________________________________________________
conv2d_153 (Conv2D)             (None, 55, 55, 64)   16448       activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_154 (Conv2D)             (None, 55, 55, 64)   36928       conv2d_153[0][0]                 
__________________________________________________________________________________________________
conv2d_155 (Conv2D)             (None, 55, 55, 256)  16640       conv2d_154[0][0]                 
__________________________________________________________________________________________________
add_21 (Add)                    (None, 55, 55, 256)  0           conv2d_155[0][0]                 
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 55, 55, 256)  0           add_21[0][0]                     
__________________________________________________________________________________________________
conv2d_156 (Conv2D)             (None, 28, 28, 128)  32896       activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_157 (Conv2D)             (None, 28, 28, 128)  147584      conv2d_156[0][0]                 
__________________________________________________________________________________________________
conv2d_158 (Conv2D)             (None, 28, 28, 512)  66048       conv2d_157[0][0]                 
__________________________________________________________________________________________________
conv2d_159 (Conv2D)             (None, 28, 28, 512)  131584      activation_3[0][0]               
__________________________________________________________________________________________________
add_22 (Add)                    (None, 28, 28, 512)  0           conv2d_158[0][0]                 
                                                                 conv2d_159[0][0]                 
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 28, 28, 512)  0           add_22[0][0]                     
__________________________________________________________________________________________________
conv2d_160 (Conv2D)             (None, 28, 28, 128)  65664       activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_161 (Conv2D)             (None, 28, 28, 128)  147584      conv2d_160[0][0]                 
__________________________________________________________________________________________________
conv2d_162 (Conv2D)             (None, 28, 28, 512)  66048       conv2d_161[0][0]                 
__________________________________________________________________________________________________
add_23 (Add)                    (None, 28, 28, 512)  0           conv2d_162[0][0]                 
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 28, 28, 512)  0           add_23[0][0]                     
__________________________________________________________________________________________________
conv2d_163 (Conv2D)             (None, 28, 28, 128)  65664       activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_164 (Conv2D)             (None, 28, 28, 128)  147584      conv2d_163[0][0]                 
__________________________________________________________________________________________________
conv2d_165 (Conv2D)             (None, 28, 28, 512)  66048       conv2d_164[0][0]                 
__________________________________________________________________________________________________
add_24 (Add)                    (None, 28, 28, 512)  0           conv2d_165[0][0]                 
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 28, 28, 512)  0           add_24[0][0]                     
__________________________________________________________________________________________________
conv2d_166 (Conv2D)             (None, 28, 28, 128)  65664       activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_167 (Conv2D)             (None, 28, 28, 128)  147584      conv2d_166[0][0]                 
__________________________________________________________________________________________________
conv2d_168 (Conv2D)             (None, 28, 28, 512)  66048       conv2d_167[0][0]                 
__________________________________________________________________________________________________
add_25 (Add)                    (None, 28, 28, 512)  0           conv2d_168[0][0]                 
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 28, 28, 512)  0           add_25[0][0]                     
__________________________________________________________________________________________________
conv2d_169 (Conv2D)             (None, 14, 14, 256)  131328      activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_170 (Conv2D)             (None, 14, 14, 256)  590080      conv2d_169[0][0]                 
__________________________________________________________________________________________________
conv2d_171 (Conv2D)             (None, 14, 14, 1024) 263168      conv2d_170[0][0]                 
__________________________________________________________________________________________________
conv2d_172 (Conv2D)             (None, 14, 14, 1024) 525312      activation_7[0][0]               
__________________________________________________________________________________________________
add_26 (Add)                    (None, 14, 14, 1024) 0           conv2d_171[0][0]                 
                                                                 conv2d_172[0][0]                 
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 14, 14, 1024) 0           add_26[0][0]                     
__________________________________________________________________________________________________
conv2d_173 (Conv2D)             (None, 14, 14, 256)  262400      activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_174 (Conv2D)             (None, 14, 14, 256)  590080      conv2d_173[0][0]                 
__________________________________________________________________________________________________
conv2d_175 (Conv2D)             (None, 14, 14, 1024) 263168      conv2d_174[0][0]                 
__________________________________________________________________________________________________
add_27 (Add)                    (None, 14, 14, 1024) 0           conv2d_175[0][0]                 
                                                                 activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 14, 14, 1024) 0           add_27[0][0]                     
__________________________________________________________________________________________________
conv2d_176 (Conv2D)             (None, 14, 14, 256)  262400      activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_177 (Conv2D)             (None, 14, 14, 256)  590080      conv2d_176[0][0]                 
__________________________________________________________________________________________________
conv2d_178 (Conv2D)             (None, 14, 14, 1024) 263168      conv2d_177[0][0]                 
__________________________________________________________________________________________________
add_28 (Add)                    (None, 14, 14, 1024) 0           conv2d_178[0][0]                 
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 14, 14, 1024) 0           add_28[0][0]                     
__________________________________________________________________________________________________
conv2d_179 (Conv2D)             (None, 14, 14, 256)  262400      activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_180 (Conv2D)             (None, 14, 14, 256)  590080      conv2d_179[0][0]                 
__________________________________________________________________________________________________
conv2d_181 (Conv2D)             (None, 14, 14, 1024) 263168      conv2d_180[0][0]                 
__________________________________________________________________________________________________
add_29 (Add)                    (None, 14, 14, 1024) 0           conv2d_181[0][0]                 
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 14, 14, 1024) 0           add_29[0][0]                     
__________________________________________________________________________________________________
conv2d_182 (Conv2D)             (None, 14, 14, 256)  262400      activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_183 (Conv2D)             (None, 14, 14, 256)  590080      conv2d_182[0][0]                 
__________________________________________________________________________________________________
conv2d_184 (Conv2D)             (None, 14, 14, 1024) 263168      conv2d_183[0][0]                 
__________________________________________________________________________________________________
add_30 (Add)                    (None, 14, 14, 1024) 0           conv2d_184[0][0]                 
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 14, 14, 1024) 0           add_30[0][0]                     
__________________________________________________________________________________________________
conv2d_185 (Conv2D)             (None, 14, 14, 256)  262400      activation_12[0][0]              
__________________________________________________________________________________________________
conv2d_186 (Conv2D)             (None, 14, 14, 256)  590080      conv2d_185[0][0]                 
__________________________________________________________________________________________________
conv2d_187 (Conv2D)             (None, 14, 14, 1024) 263168      conv2d_186[0][0]                 
__________________________________________________________________________________________________
add_31 (Add)                    (None, 14, 14, 1024) 0           conv2d_187[0][0]                 
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 14, 14, 1024) 0           add_31[0][0]                     
__________________________________________________________________________________________________
conv2d_188 (Conv2D)             (None, 7, 7, 512)    524800      activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_189 (Conv2D)             (None, 7, 7, 512)    2359808     conv2d_188[0][0]                 
__________________________________________________________________________________________________
conv2d_190 (Conv2D)             (None, 7, 7, 2048)   1050624     conv2d_189[0][0]                 
__________________________________________________________________________________________________
conv2d_191 (Conv2D)             (None, 7, 7, 2048)   2099200     activation_13[0][0]              
__________________________________________________________________________________________________
add_32 (Add)                    (None, 7, 7, 2048)   0           conv2d_190[0][0]                 
                                                                 conv2d_191[0][0]                 
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 7, 7, 2048)   0           add_32[0][0]                     
__________________________________________________________________________________________________
conv2d_192 (Conv2D)             (None, 7, 7, 512)    1049088     activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_193 (Conv2D)             (None, 7, 7, 512)    2359808     conv2d_192[0][0]                 
__________________________________________________________________________________________________
conv2d_194 (Conv2D)             (None, 7, 7, 2048)   1050624     conv2d_193[0][0]                 
__________________________________________________________________________________________________
add_33 (Add)                    (None, 7, 7, 2048)   0           conv2d_194[0][0]                 
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 7, 7, 2048)   0           add_33[0][0]                     
__________________________________________________________________________________________________
conv2d_195 (Conv2D)             (None, 7, 7, 512)    1049088     activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_196 (Conv2D)             (None, 7, 7, 512)    2359808     conv2d_195[0][0]                 
__________________________________________________________________________________________________
conv2d_197 (Conv2D)             (None, 7, 7, 2048)   1050624     conv2d_196[0][0]                 
__________________________________________________________________________________________________
add_34 (Add)                    (None, 7, 7, 2048)   0           conv2d_197[0][0]                 
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 7, 7, 2048)   0           add_34[0][0]                     
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 2048)   0           activation_16[0][0]              
__________________________________________________________________________________________________
flatten_5 (Flatten)             (None, 2048)         0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 1000)         2049000     flatten_5[0][0]                  
==================================================================================================
Total params: 25,530,472
Trainable params: 25,530,472
Non-trainable params: 0
__________________________________________________________________________________________________
None
