__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 230, 230, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
resnet50_original_1 (Conv2D)    (None, 112, 112, 64) 9472        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 55, 55, 64)   0           resnet50_original_1[0][0]        
__________________________________________________________________________________________________
resnet50_original_2a_conv (Conv (None, 55, 55, 64)   4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
resnet50_original_2b_conv (Conv (None, 55, 55, 64)   36928       resnet50_original_2a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_2c_conv (Conv (None, 55, 55, 256)  16640       resnet50_original_2b_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_2s_conv (Conv (None, 55, 55, 256)  16640       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
add_1 (Add)                     (None, 55, 55, 256)  0           resnet50_original_2c_conv[0][0]  
                                                                 resnet50_original_2s_conv[0][0]  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 55, 55, 256)  0           add_1[0][0]                      
__________________________________________________________________________________________________
resnet50_original_3a_conv (Conv (None, 55, 55, 64)   16448       activation_1[0][0]               
__________________________________________________________________________________________________
resnet50_original_3b_conv (Conv (None, 55, 55, 64)   36928       resnet50_original_3a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_3c_conv (Conv (None, 55, 55, 256)  16640       resnet50_original_3b_conv[0][0]  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 55, 55, 256)  0           resnet50_original_3c_conv[0][0]  
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 55, 55, 256)  0           add_2[0][0]                      
__________________________________________________________________________________________________
resnet50_original_4a_conv (Conv (None, 55, 55, 64)   16448       activation_2[0][0]               
__________________________________________________________________________________________________
resnet50_original_4b_conv (Conv (None, 55, 55, 64)   36928       resnet50_original_4a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_4c_conv (Conv (None, 55, 55, 256)  16640       resnet50_original_4b_conv[0][0]  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 55, 55, 256)  0           resnet50_original_4c_conv[0][0]  
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 55, 55, 256)  0           add_3[0][0]                      
__________________________________________________________________________________________________
resnet50_original_5a_conv (Conv (None, 28, 28, 128)  32896       activation_3[0][0]               
__________________________________________________________________________________________________
resnet50_original_5b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_5a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_5c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_5b_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_5s_conv (Conv (None, 28, 28, 512)  131584      activation_3[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 28, 28, 512)  0           resnet50_original_5c_conv[0][0]  
                                                                 resnet50_original_5s_conv[0][0]  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 28, 28, 512)  0           add_4[0][0]                      
__________________________________________________________________________________________________
resnet50_original_6a_conv (Conv (None, 28, 28, 128)  65664       activation_4[0][0]               
__________________________________________________________________________________________________
resnet50_original_6b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_6a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_6c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_6b_conv[0][0]  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 28, 28, 512)  0           resnet50_original_6c_conv[0][0]  
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 28, 28, 512)  0           add_5[0][0]                      
__________________________________________________________________________________________________
resnet50_original_7a_conv (Conv (None, 28, 28, 128)  65664       activation_5[0][0]               
__________________________________________________________________________________________________
resnet50_original_7b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_7a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_7c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_7b_conv[0][0]  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 28, 28, 512)  0           resnet50_original_7c_conv[0][0]  
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 28, 28, 512)  0           add_6[0][0]                      
__________________________________________________________________________________________________
resnet50_original_8a_conv (Conv (None, 28, 28, 128)  65664       activation_6[0][0]               
__________________________________________________________________________________________________
resnet50_original_8b_conv (Conv (None, 28, 28, 128)  147584      resnet50_original_8a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_8c_conv (Conv (None, 28, 28, 512)  66048       resnet50_original_8b_conv[0][0]  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 28, 28, 512)  0           resnet50_original_8c_conv[0][0]  
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 28, 28, 512)  0           add_7[0][0]                      
__________________________________________________________________________________________________
resnet50_original_9a_conv (Conv (None, 14, 14, 256)  131328      activation_7[0][0]               
__________________________________________________________________________________________________
resnet50_original_9b_conv (Conv (None, 14, 14, 256)  590080      resnet50_original_9a_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_9c_conv (Conv (None, 14, 14, 1024) 263168      resnet50_original_9b_conv[0][0]  
__________________________________________________________________________________________________
resnet50_original_9s_conv (Conv (None, 14, 14, 1024) 525312      activation_7[0][0]               
__________________________________________________________________________________________________
add_8 (Add)                     (None, 14, 14, 1024) 0           resnet50_original_9c_conv[0][0]  
                                                                 resnet50_original_9s_conv[0][0]  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 14, 14, 1024) 0           add_8[0][0]                      
__________________________________________________________________________________________________
resnet50_original_10a_conv (Con (None, 14, 14, 256)  262400      activation_8[0][0]               
__________________________________________________________________________________________________
resnet50_original_10b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_10a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_10c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_10b_conv[0][0] 
__________________________________________________________________________________________________
add_9 (Add)                     (None, 14, 14, 1024) 0           resnet50_original_10c_conv[0][0] 
                                                                 activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 14, 14, 1024) 0           add_9[0][0]                      
__________________________________________________________________________________________________
resnet50_original_11a_conv (Con (None, 14, 14, 256)  262400      activation_9[0][0]               
__________________________________________________________________________________________________
resnet50_original_11b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_11a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_11c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_11b_conv[0][0] 
__________________________________________________________________________________________________
add_10 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_11c_conv[0][0] 
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 14, 14, 1024) 0           add_10[0][0]                     
__________________________________________________________________________________________________
resnet50_original_12a_conv (Con (None, 14, 14, 256)  262400      activation_10[0][0]              
__________________________________________________________________________________________________
resnet50_original_12b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_12a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_12c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_12b_conv[0][0] 
__________________________________________________________________________________________________
add_11 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_12c_conv[0][0] 
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 14, 14, 1024) 0           add_11[0][0]                     
__________________________________________________________________________________________________
resnet50_original_13a_conv (Con (None, 14, 14, 256)  262400      activation_11[0][0]              
__________________________________________________________________________________________________
resnet50_original_13b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_13a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_13c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_13b_conv[0][0] 
__________________________________________________________________________________________________
add_12 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_13c_conv[0][0] 
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 14, 14, 1024) 0           add_12[0][0]                     
__________________________________________________________________________________________________
resnet50_original_14a_conv (Con (None, 14, 14, 256)  262400      activation_12[0][0]              
__________________________________________________________________________________________________
resnet50_original_14b_conv (Con (None, 14, 14, 256)  590080      resnet50_original_14a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_14c_conv (Con (None, 14, 14, 1024) 263168      resnet50_original_14b_conv[0][0] 
__________________________________________________________________________________________________
add_13 (Add)                    (None, 14, 14, 1024) 0           resnet50_original_14c_conv[0][0] 
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 14, 14, 1024) 0           add_13[0][0]                     
__________________________________________________________________________________________________
resnet50_original_15a_conv (Con (None, 7, 7, 512)    524800      activation_13[0][0]              
__________________________________________________________________________________________________
resnet50_original_15b_conv (Con (None, 7, 7, 512)    2359808     resnet50_original_15a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_15c_conv (Con (None, 7, 7, 2048)   1050624     resnet50_original_15b_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_15s_conv (Con (None, 7, 7, 2048)   2099200     activation_13[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 7, 7, 2048)   0           resnet50_original_15c_conv[0][0] 
                                                                 resnet50_original_15s_conv[0][0] 
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 7, 7, 2048)   0           add_14[0][0]                     
__________________________________________________________________________________________________
resnet50_original_16a_conv (Con (None, 7, 7, 512)    1049088     activation_14[0][0]              
__________________________________________________________________________________________________
resnet50_original_16b_conv (Con (None, 7, 7, 512)    2359808     resnet50_original_16a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_16c_conv (Con (None, 7, 7, 2048)   1050624     resnet50_original_16b_conv[0][0] 
__________________________________________________________________________________________________
add_15 (Add)                    (None, 7, 7, 2048)   0           resnet50_original_16c_conv[0][0] 
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 7, 7, 2048)   0           add_15[0][0]                     
__________________________________________________________________________________________________
resnet50_original_17a_conv (Con (None, 7, 7, 512)    1049088     activation_15[0][0]              
__________________________________________________________________________________________________
resnet50_original_17b_conv (Con (None, 7, 7, 512)    2359808     resnet50_original_17a_conv[0][0] 
__________________________________________________________________________________________________
resnet50_original_17c_conv (Con (None, 7, 7, 2048)   1050624     resnet50_original_17b_conv[0][0] 
__________________________________________________________________________________________________
add_16 (Add)                    (None, 7, 7, 2048)   0           resnet50_original_17c_conv[0][0] 
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 7, 7, 2048)   0           add_16[0][0]                     
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 2048)   0           activation_16[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2048)         0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
resnet50_original_18_dense (Den (None, 1000)         2049000     flatten_1[0][0]                  
==================================================================================================
Total params: 25,530,472
Trainable params: 25,530,472
Non-trainable params: 0
__________________________________________________________________________________________________
None
