__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 230, 230, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 112, 112, 64) 9472        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 55, 55, 64)   0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 55, 55, 64)   4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 55, 55, 64)   36928       conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 55, 55, 256)  16640       conv2d_3[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 55, 55, 256)  16640       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
add_1 (Add)                     (None, 55, 55, 256)  0           conv2d_4[0][0]                   
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 55, 55, 256)  0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 55, 55, 64)   16448       activation_1[0][0]               
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 55, 55, 64)   36928       conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 55, 55, 256)  16640       conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 55, 55, 256)  0           conv2d_8[0][0]                   
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 55, 55, 256)  0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 55, 55, 64)   16448       activation_2[0][0]               
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 55, 55, 64)   36928       conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 55, 55, 256)  16640       conv2d_10[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 55, 55, 256)  0           conv2d_11[0][0]                  
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 55, 55, 256)  0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 28, 28, 128)  32896       activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 28, 28, 128)  147584      conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 28, 28, 512)  66048       conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 28, 28, 512)  131584      activation_3[0][0]               
__________________________________________________________________________________________________
add_4 (Add)                     (None, 28, 28, 512)  0           conv2d_14[0][0]                  
                                                                 conv2d_15[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 28, 28, 512)  0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 28, 28, 128)  65664       activation_4[0][0]               
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 28, 28, 128)  147584      conv2d_16[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 28, 28, 512)  66048       conv2d_17[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 28, 28, 512)  0           conv2d_18[0][0]                  
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 28, 28, 512)  0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 28, 28, 128)  65664       activation_5[0][0]               
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 28, 28, 128)  147584      conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 28, 28, 512)  66048       conv2d_20[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 28, 28, 512)  0           conv2d_21[0][0]                  
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 28, 28, 512)  0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 28, 28, 128)  65664       activation_6[0][0]               
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 28, 28, 128)  147584      conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 28, 28, 512)  66048       conv2d_23[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 28, 28, 512)  0           conv2d_24[0][0]                  
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 28, 28, 512)  0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 14, 14, 256)  131328      activation_7[0][0]               
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 14, 14, 256)  590080      conv2d_25[0][0]                  
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 14, 14, 1024) 263168      conv2d_26[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 14, 14, 1024) 525312      activation_7[0][0]               
__________________________________________________________________________________________________
add_8 (Add)                     (None, 14, 14, 1024) 0           conv2d_27[0][0]                  
                                                                 conv2d_28[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 14, 14, 1024) 0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 14, 14, 256)  262400      activation_8[0][0]               
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 14, 14, 256)  590080      conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 14, 14, 1024) 263168      conv2d_30[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 14, 14, 1024) 0           conv2d_31[0][0]                  
                                                                 activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 14, 14, 1024) 0           add_9[0][0]                      
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 14, 14, 256)  262400      activation_9[0][0]               
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 14, 14, 256)  590080      conv2d_32[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 14, 14, 1024) 263168      conv2d_33[0][0]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 14, 14, 1024) 0           conv2d_34[0][0]                  
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 14, 14, 1024) 0           add_10[0][0]                     
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 14, 14, 256)  262400      activation_10[0][0]              
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 14, 14, 256)  590080      conv2d_35[0][0]                  
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 14, 14, 1024) 263168      conv2d_36[0][0]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 14, 14, 1024) 0           conv2d_37[0][0]                  
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 14, 14, 1024) 0           add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 14, 14, 256)  262400      activation_11[0][0]              
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 14, 14, 256)  590080      conv2d_38[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 14, 14, 1024) 263168      conv2d_39[0][0]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 14, 14, 1024) 0           conv2d_40[0][0]                  
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 14, 14, 1024) 0           add_12[0][0]                     
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 14, 14, 256)  262400      activation_12[0][0]              
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 14, 14, 256)  590080      conv2d_41[0][0]                  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 14, 14, 1024) 263168      conv2d_42[0][0]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 14, 14, 1024) 0           conv2d_43[0][0]                  
                                                                 activation_12[0][0]              
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 14, 14, 1024) 0           add_13[0][0]                     
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 7, 7, 512)    524800      activation_13[0][0]              
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 7, 7, 512)    2359808     conv2d_44[0][0]                  
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 7, 7, 2048)   1050624     conv2d_45[0][0]                  
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 7, 7, 2048)   2099200     activation_13[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 7, 7, 2048)   0           conv2d_46[0][0]                  
                                                                 conv2d_47[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 7, 7, 2048)   0           add_14[0][0]                     
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 7, 7, 512)    1049088     activation_14[0][0]              
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 7, 7, 512)    2359808     conv2d_48[0][0]                  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 7, 7, 2048)   1050624     conv2d_49[0][0]                  
__________________________________________________________________________________________________
add_15 (Add)                    (None, 7, 7, 2048)   0           conv2d_50[0][0]                  
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 7, 7, 2048)   0           add_15[0][0]                     
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 7, 7, 512)    1049088     activation_15[0][0]              
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 7, 7, 512)    2359808     conv2d_51[0][0]                  
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 7, 7, 2048)   1050624     conv2d_52[0][0]                  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 7, 7, 2048)   0           conv2d_53[0][0]                  
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 7, 7, 2048)   0           add_16[0][0]                     
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 1, 1, 2048)   0           activation_16[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2048)         0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1000)         2049000     flatten_1[0][0]                  
==================================================================================================
Total params: 25,530,472
Trainable params: 25,530,472
Non-trainable params: 0
__________________________________________________________________________________________________
None
