__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_14 (Lambda)              [(None, 220, 220, 3) 0           input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 220, 220, 21) 588         lambda_14[0][0]                  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 220, 220, 21) 588         lambda_14[0][1]                  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 220, 220, 22) 616         lambda_14[0][2]                  
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 220, 220, 64) 0           conv2d_53[0][0]                  
                                                                 conv2d_54[0][0]                  
                                                                 conv2d_55[0][0]                  
__________________________________________________________________________________________________
lambda_15 (Lambda)              [(None, 220, 220, 64 0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 220, 220, 21) 12117       lambda_15[0][0]                  
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 220, 220, 21) 12117       lambda_15[0][1]                  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 220, 220, 22) 12694       lambda_15[0][2]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 220, 220, 64) 0           conv2d_56[0][0]                  
                                                                 conv2d_57[0][0]                  
                                                                 conv2d_58[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 110, 110, 64) 0           concatenate_2[0][0]              
__________________________________________________________________________________________________
lambda_16 (Lambda)              [(None, 110, 110, 64 0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 110, 110, 42) 24234       lambda_16[0][0]                  
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 110, 110, 42) 24234       lambda_16[0][1]                  
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 110, 110, 44) 25388       lambda_16[0][2]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 110, 110, 128 0           conv2d_59[0][0]                  
                                                                 conv2d_60[0][0]                  
                                                                 conv2d_61[0][0]                  
__________________________________________________________________________________________________
lambda_17 (Lambda)              [(None, 110, 110, 12 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 110, 110, 42) 48426       lambda_17[0][0]                  
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 110, 110, 42) 48426       lambda_17[0][1]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 110, 110, 44) 50732       lambda_17[0][2]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 110, 110, 128 0           conv2d_62[0][0]                  
                                                                 conv2d_63[0][0]                  
                                                                 conv2d_64[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 55, 55, 128)  0           concatenate_4[0][0]              
__________________________________________________________________________________________________
lambda_18 (Lambda)              [(None, 55, 55, 128) 0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 55, 55, 85)   98005       lambda_18[0][0]                  
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 55, 55, 85)   98005       lambda_18[0][1]                  
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 55, 55, 86)   99158       lambda_18[0][2]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 55, 55, 256)  0           conv2d_65[0][0]                  
                                                                 conv2d_66[0][0]                  
                                                                 conv2d_67[0][0]                  
__________________________________________________________________________________________________
lambda_19 (Lambda)              [(None, 55, 55, 256) 0           concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 55, 55, 85)   195925      lambda_19[0][0]                  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 55, 55, 85)   195925      lambda_19[0][1]                  
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 55, 55, 86)   198230      lambda_19[0][2]                  
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 55, 55, 256)  0           conv2d_68[0][0]                  
                                                                 conv2d_69[0][0]                  
                                                                 conv2d_70[0][0]                  
__________________________________________________________________________________________________
lambda_20 (Lambda)              [(None, 55, 55, 256) 0           concatenate_6[0][0]              
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 55, 55, 85)   195925      lambda_20[0][0]                  
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 55, 55, 85)   195925      lambda_20[0][1]                  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 55, 55, 86)   198230      lambda_20[0][2]                  
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 55, 55, 256)  0           conv2d_71[0][0]                  
                                                                 conv2d_72[0][0]                  
                                                                 conv2d_73[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 27, 27, 256)  0           concatenate_7[0][0]              
__________________________________________________________________________________________________
lambda_21 (Lambda)              [(None, 27, 27, 256) 0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 27, 27, 170)  391850      lambda_21[0][0]                  
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 27, 27, 170)  391850      lambda_21[0][1]                  
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 27, 27, 172)  396460      lambda_21[0][2]                  
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 27, 27, 512)  0           conv2d_74[0][0]                  
                                                                 conv2d_75[0][0]                  
                                                                 conv2d_76[0][0]                  
__________________________________________________________________________________________________
lambda_22 (Lambda)              [(None, 27, 27, 512) 0           concatenate_8[0][0]              
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 27, 27, 170)  783530      lambda_22[0][0]                  
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 27, 27, 170)  783530      lambda_22[0][1]                  
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 27, 27, 172)  792748      lambda_22[0][2]                  
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 27, 27, 512)  0           conv2d_77[0][0]                  
                                                                 conv2d_78[0][0]                  
                                                                 conv2d_79[0][0]                  
__________________________________________________________________________________________________
lambda_23 (Lambda)              [(None, 27, 27, 512) 0           concatenate_9[0][0]              
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 27, 27, 170)  783530      lambda_23[0][0]                  
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 27, 27, 170)  783530      lambda_23[0][1]                  
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 27, 27, 172)  792748      lambda_23[0][2]                  
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 27, 27, 512)  0           conv2d_80[0][0]                  
                                                                 conv2d_81[0][0]                  
                                                                 conv2d_82[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 13, 13, 512)  0           concatenate_10[0][0]             
__________________________________________________________________________________________________
lambda_24 (Lambda)              [(None, 13, 13, 512) 0           max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 13, 13, 170)  783530      lambda_24[0][0]                  
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 13, 13, 170)  783530      lambda_24[0][1]                  
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 13, 13, 172)  792748      lambda_24[0][2]                  
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 13, 13, 512)  0           conv2d_83[0][0]                  
                                                                 conv2d_84[0][0]                  
                                                                 conv2d_85[0][0]                  
__________________________________________________________________________________________________
lambda_25 (Lambda)              [(None, 13, 13, 512) 0           concatenate_11[0][0]             
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 13, 13, 170)  783530      lambda_25[0][0]                  
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 13, 13, 170)  783530      lambda_25[0][1]                  
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 13, 13, 172)  792748      lambda_25[0][2]                  
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 13, 13, 512)  0           conv2d_86[0][0]                  
                                                                 conv2d_87[0][0]                  
                                                                 conv2d_88[0][0]                  
__________________________________________________________________________________________________
lambda_26 (Lambda)              [(None, 13, 13, 512) 0           concatenate_12[0][0]             
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 13, 13, 170)  783530      lambda_26[0][0]                  
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 13, 13, 170)  783530      lambda_26[0][1]                  
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 13, 13, 172)  792748      lambda_26[0][2]                  
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 13, 13, 512)  0           conv2d_89[0][0]                  
                                                                 conv2d_90[0][0]                  
                                                                 conv2d_91[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 6, 6, 512)    0           concatenate_13[0][0]             
__________________________________________________________________________________________________
flatten (Flatten)               (None, 18432)        0           max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 4096)         75501568    flatten[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 4096)         16781312    dense_7[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1000)         4097000     dense_8[0][0]                    
==================================================================================================
Total params: 111,094,568
Trainable params: 111,094,568
Non-trainable params: 0
__________________________________________________________________________________________________
None
