_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 220, 220, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 220, 220, 64)      1792      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 220, 220, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 110, 110, 64)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 110, 110, 128)     73856     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 110, 110, 128)     147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 55, 55, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 55, 55, 256)       295168    
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 55, 55, 256)       590080    
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 55, 55, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 27, 27, 256)       0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 27, 27, 512)       1180160   
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 27, 27, 512)       2359808   
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 27, 27, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 13, 13, 512)       0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 13, 13, 512)       2359808   
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 13, 13, 512)       2359808   
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 13, 13, 512)       2359808   
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 6, 6, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 18432)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              75501568  
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dense_3 (Dense)              (None, 1000)              4097000   
=================================================================
Total params: 111,094,568
Trainable params: 111,094,568
Non-trainable params: 0
_________________________________________________________________
None
