_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 112, 112, 16, 3)   0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 112, 112, 16, 64)  5248      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 56, 56, 16, 64)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 56, 56, 16, 128)   221312    
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 28, 28, 8, 128)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 28, 28, 8, 256)    884992    
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 28, 28, 8, 256)    1769728   
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 14, 14, 4, 256)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 14, 14, 4, 512)    3539456   
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 14, 14, 4, 512)    7078400   
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 7, 7, 2, 512)      0         
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 7, 7, 2, 512)      7078400   
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 7, 7, 2, 512)      7078400   
_________________________________________________________________
max_pooling3d_5 (MaxPooling3 (None, 4, 4, 1, 512)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              33558528  
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dense_3 (Dense)              (None, 487)               1995239   
=================================================================
Total params: 79,991,015
Trainable params: 79,991,015
Non-trainable params: 0
_________________________________________________________________
None
