_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 220, 220, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 55, 55, 48)        17472     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 27, 27, 48)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 27, 27, 128)       153728    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 13, 13, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 13, 13, 192)       221376    
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 13, 13, 192)       331968    
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 13, 13, 128)       221312    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 6, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              18878464  
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312  
_________________________________________________________________
dense_3 (Dense)              (None, 1000)              4097000   
=================================================================
Total params: 40,702,632
Trainable params: 40,702,632
Non-trainable params: 0
_________________________________________________________________
None
