__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            (None, 220, 220, 3)  0                                            
__________________________________________________________________________________________________
lambda_6 (Lambda)               [(None, 220, 220, 3) 0           input_3[0][0]                    
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 55, 55, 16)   5824        lambda_6[0][0]                   
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 55, 55, 16)   5824        lambda_6[0][1]                   
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 55, 55, 16)   5824        lambda_6[0][2]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 55, 55, 48)   0           conv2d_21[0][0]                  
                                                                 conv2d_22[0][0]                  
                                                                 conv2d_23[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 27, 27, 48)   0           concatenate_1[0][0]              
__________________________________________________________________________________________________
lambda_7 (Lambda)               [(None, 27, 27, 48), 0           max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 27, 27, 42)   50442       lambda_7[0][0]                   
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 27, 27, 42)   50442       lambda_7[0][1]                   
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 27, 27, 44)   52844       lambda_7[0][2]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 27, 27, 128)  0           conv2d_24[0][0]                  
                                                                 conv2d_25[0][0]                  
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 13, 13, 128)  0           concatenate_2[0][0]              
__________________________________________________________________________________________________
lambda_8 (Lambda)               [(None, 13, 13, 128) 0           max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 13, 13, 64)   73792       lambda_8[0][0]                   
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 13, 13, 64)   73792       lambda_8[0][1]                   
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 13, 13, 64)   73792       lambda_8[0][2]                   
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 13, 13, 192)  0           conv2d_27[0][0]                  
                                                                 conv2d_28[0][0]                  
                                                                 conv2d_29[0][0]                  
__________________________________________________________________________________________________
lambda_9 (Lambda)               [(None, 13, 13, 192) 0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 13, 13, 64)   110656      lambda_9[0][0]                   
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 13, 13, 64)   110656      lambda_9[0][1]                   
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 13, 13, 64)   110656      lambda_9[0][2]                   
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 13, 13, 192)  0           conv2d_30[0][0]                  
                                                                 conv2d_31[0][0]                  
                                                                 conv2d_32[0][0]                  
__________________________________________________________________________________________________
lambda_10 (Lambda)              [(None, 13, 13, 192) 0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 13, 13, 42)   72618       lambda_10[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 13, 13, 42)   72618       lambda_10[0][1]                  
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 13, 13, 44)   76076       lambda_10[0][2]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 13, 13, 128)  0           conv2d_33[0][0]                  
                                                                 conv2d_34[0][0]                  
                                                                 conv2d_35[0][0]                  
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 6, 6, 128)    0           concatenate_5[0][0]              
__________________________________________________________________________________________________
flatten_3 (Flatten)             (None, 4608)         0           max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 4096)         18878464    flatten_3[0][0]                  
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 4096)         16781312    dense_7[0][0]                    
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 1000)         4097000     dense_8[0][0]                    
==================================================================================================
Total params: 40,702,632
Trainable params: 40,702,632
Non-trainable params: 0
__________________________________________________________________________________________________
None
