__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 224, 224, 3)  0                                            
__________________________________________________________________________________________________
yolo_original_1_conv (Conv2D)   (None, 224, 224, 32) 864         input_1[0][0]                    
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 112, 112, 32) 0           yolo_original_1_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_2_conv (Conv2D)   (None, 112, 112, 64) 18432       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 56, 56, 64)   0           yolo_original_2_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_3_conv (Conv2D)   (None, 56, 56, 128)  73728       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
yolo_original_4_conv (Conv2D)   (None, 56, 56, 64)   8192        yolo_original_3_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_5_conv (Conv2D)   (None, 56, 56, 128)  73728       yolo_original_4_conv[0][0]       
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 28, 28, 128)  0           yolo_original_5_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_6_conv (Conv2D)   (None, 28, 28, 256)  294912      max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
yolo_original_7_conv (Conv2D)   (None, 28, 28, 128)  32768       yolo_original_6_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_8_conv (Conv2D)   (None, 28, 28, 256)  294912      yolo_original_7_conv[0][0]       
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 14, 14, 256)  0           yolo_original_8_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_9_conv (Conv2D)   (None, 14, 14, 512)  1179648     max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
yolo_original_10_conv (Conv2D)  (None, 14, 14, 256)  131072      yolo_original_9_conv[0][0]       
__________________________________________________________________________________________________
yolo_original_11_conv (Conv2D)  (None, 14, 14, 512)  1179648     yolo_original_10_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_12_conv (Conv2D)  (None, 14, 14, 256)  131072      yolo_original_11_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_13_conv (Conv2D)  (None, 14, 14, 512)  1179648     yolo_original_12_conv[0][0]      
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 7, 7, 512)    0           yolo_original_13_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_14_conv (Conv2D)  (None, 7, 7, 1024)   4718592     max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
yolo_original_15_conv (Conv2D)  (None, 7, 7, 512)    524288      yolo_original_14_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_16_conv (Conv2D)  (None, 7, 7, 1024)   4718592     yolo_original_15_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_17_conv (Conv2D)  (None, 7, 7, 512)    524288      yolo_original_16_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_18_conv (Conv2D)  (None, 7, 7, 1024)   4718592     yolo_original_17_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_21_conv (Conv2D)  (None, 14, 14, 64)   32768       yolo_original_13_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_19_conv (Conv2D)  (None, 7, 7, 1024)   9437184     yolo_original_18_conv[0][0]      
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 7, 7, 256)    0           yolo_original_21_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_20_conv (Conv2D)  (None, 7, 7, 1024)   9437184     yolo_original_19_conv[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 7, 7, 1280)   0           lambda_1[0][0]                   
                                                                 yolo_original_20_conv[0][0]      
__________________________________________________________________________________________________
yolo_original_22_conv (Conv2D)  (None, 7, 7, 1024)   11796480    concatenate_1[0][0]              
__________________________________________________________________________________________________
yolo_original_23_conv (Conv2D)  (None, 7, 7, 5025)   5150625     yolo_original_22_conv[0][0]      
==================================================================================================
Total params: 55,657,217
Trainable params: 55,657,217
Non-trainable params: 0
__________________________________________________________________________________________________
None
